
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十章    拓展阅读（选学） · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="d9z.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="d1z.html">
            
                <a href="d1z.html">
            
                    
                    第一章    异常处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="d2z.html">
            
                <a href="d2z.html">
            
                    
                    第二章    数据结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="d3z.html">
            
                <a href="d3z.html">
            
                    
                    第三章    集合和泛型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="d4z.html">
            
                <a href="d4z.html">
            
                    
                    第四章    IO和XML
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="d5z.html">
            
                <a href="d5z.html">
            
                    
                    第五章    反射机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="d6z.html">
            
                <a href="d6z.html">
            
                    
                    第六章    多线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="d7z.html">
            
                <a href="d7z.html">
            
                    
                    第七章    网络编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="d8z.html">
            
                <a href="d8z.html">
            
                    
                    第八章    Java注解
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="d9z.html">
            
                <a href="d9z.html">
            
                    
                    第九章    软件测试与JUnit
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.11" data-path="d10z.html">
            
                <a href="d10z.html">
            
                    
                    第十章    拓展阅读（选学）
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第十章    拓展阅读（选学）</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x672C;&#x7AE0;&#x7B80;&#x4ECB;">&#x672C;&#x7AE0;&#x7B80;&#x4ECB;</h2>
<p>&#x2003;&#x2003;&#x672C;&#x7AE0;&#x4F5C;&#x4E3A;&#x9009;&#x5B66;&#x7AE0;&#x8282;&#xFF0C;&#x5C06;&#x4F1A;&#x8BB2;&#x89E3;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x3001;&#x5E38;&#x89C1;&#x6BD4;&#x8F83;&#x3001;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x4EE5;&#x53CA;&#x7EBF;&#x7A0B;&#x6B7B;&#x9501;&#x548C;&#x534F;&#x4F5C;&#x7B49;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#x3002;&#x5BF9;&#x4E8E;&#x5B9E;&#x9645;&#x5F00;&#x53D1;&#x800C;&#x8A00;&#xFF0C;&#x672C;&#x7AE0;&#x7684;&#x4F7F;&#x7528;&#x9891;&#x7387;&#x8F83;&#x4F4E;&#xFF0C;&#x56E0;&#x6B64;&#x5EFA;&#x8BAE;&#x8BFB;&#x8005;&#x5728;&#x638C;&#x63E1;&#x4E86;&#x524D;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x540E;&#x518D;&#x6765;&#x5B66;&#x4E60;&#xFF1B;&#x4F46;&#x5BF9;&#x4E8E;&#x9762;&#x8BD5;&#x6765;&#x8BB2;&#xFF0C;&#x672C;&#x7AE0;&#x7684;&#x4E00;&#x4E9B;&#x77E5;&#x8BC6;&#x70B9;&#x7ECF;&#x5E38;&#x4F1A;&#x4F5C;&#x4E3A;&#x9762;&#x8BD5;&#x9898;&#x6765;&#x8FDB;&#x884C;&#x8003;&#x67E5;&#x3002;</p>
<p>&#x2003;&#x2003;&#x672C;&#x7AE0;&#x7684;&#x6700;&#x540E;&#xFF0C;&#x8FD8;&#x4F1A;&#x5411;&#x5927;&#x5BB6;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;Java 8&#x7684;&#x4E00;&#x4E9B;&#x65B0;&#x7279;&#x6027;&#x3002;</p>
<h2 id="101--&#x6392;&#x5E8F;&#x7B97;&#x6CD5;">10.1  &#x6392;&#x5E8F;&#x7B97;&#x6CD5;</h2>
<p>&#x2003;&#x2003;&#x5728;&#x5B66;&#x4E60;&#x300A;Java&#x8BED;&#x8A00;&#x57FA;&#x7840;&#x4E0E;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x5B9E;&#x8DF5;&#x300B;&#x65F6;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E86;&#x4E24;&#x79CD;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x5192;&#x6CE1;&#x6392;&#x5E8F;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x76F4;&#x63A5;&#x63D2;&#x5165;&#x6392;&#x5E8F;&#xFF0C;&#x73B0;&#x5728;&#x5148;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x5192;&#x6CE1;&#x6392;&#x5E8F;&#x548C;&#x76F4;&#x63A5;&#x63D2;&#x5165;&#x6392;&#x5E8F;&#x3002;</p>
<ul>
<li>&#x5192;&#x6CE1;&#x6392;&#x5E8F;</li>
</ul>
<p>&#x2003;&#x2003;<a href="http://baike.baidu.com/view/94651.htm" target="_blank">&#x5192;&#x6CE1;</a>&#x6392;&#x5E8F;&#x5C31;&#x662F;&#x4F9D;&#x6B21;&#x6BD4;&#x8F83;&#x76F8;&#x90BB;&#x7684;&#x4E24;&#x4E2A;&#x6570;&#xFF0C;&#x5C06;&#x5C0F;&#x6570;&#x653E;&#x5728;&#x524D;&#x9762;&#xFF0C;&#x5927;&#x6570;&#x653E;&#x5728;&#x540E;&#x9762;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7B2C;&#x4E00;&#x8F6E;&#xFF1A;&#x9996;&#x5148;&#x6BD4;&#x8F83;&#x7B2C;1&#x4E2A;&#x548C;&#x7B2C;2&#x4E2A;&#x6570;&#xFF0C;&#x5C06;&#x5C0F;&#x6570;&#x653E;&#x524D;&#xFF0C;&#x5927;&#x6570;&#x653E;&#x540E;&#x3002;&#x7136;&#x540E;&#x6BD4;&#x8F83;&#x7B2C;2&#x4E2A;&#x6570;&#x548C;&#x7B2C;3&#x4E2A;&#x6570;&#xFF0C;&#x5C06;&#x5C0F;&#x6570;&#x653E;&#x524D;&#xFF0C;&#x5927;&#x6570;&#x653E;&#x540E;&#xFF0C;&#x4F9D;&#x6B21;&#x7C7B;&#x63A8;&#xFF0C;&#x76F4;&#x81F3;&#x6BD4;&#x8F83;&#x6700;&#x540E;&#x4E24;&#x4E2A;&#x6570;&#xFF0C;&#x5C06;&#x5C0F;&#x6570;&#x653E;&#x524D;&#xFF0C;&#x5927;&#x6570;&#x653E;&#x540E;&#x3002;&#x81F3;&#x6B64;&#x7B2C;&#x4E00;&#x8F6E;&#x7ED3;&#x675F;&#xFF0C;&#x5C06;&#x6700;&#x5927;&#x7684;&#x6570;&#x653E;&#x5230;&#x4E86;&#x6700;&#x540E;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7B2C;&#x4E8C;&#x8F6E;&#xFF1A;&#x4ECD;&#x4ECE;&#x7B2C;1&#x5BF9;&#x6570;&#x5F00;&#x59CB;&#x6BD4;&#x8F83;&#xFF0C;&#x5C06;&#x5C0F;&#x6570;&#x653E;&#x524D;&#xFF0C;&#x5927;&#x6570;&#x653E;&#x540E;&#xFF0C;&#x4E00;&#x76F4;&#x6BD4;&#x8F83;&#x5230;&#x5012;&#x6570;&#x7B2C;2&#x4E2A;&#x6570;&#xFF08;&#x5012;&#x6570;&#x7B2C;&#x4E00;&#x7684;&#x4F4D;&#x7F6E;&#x4E0A;&#x5DF2;&#x7ECF;&#x662F;&#x6700;&#x5927;&#x7684;&#x6570;&#xFF09;&#xFF0C;&#x7B2C;&#x4E8C;&#x8F6E;&#x7ED3;&#x675F;&#xFF0C;&#x5728;&#x5012;&#x6570;&#x7B2C;&#x4E8C;&#x7684;&#x4F4D;&#x7F6E;&#x4E0A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6700;&#x5927;&#x6570;&#xFF08;&#x5176;&#x5B9E;&#x5728;&#x6574;&#x4E2A;&#x6570;&#x5217;&#x4E2D;&#x662F;&#x7B2C;&#x4E8C;&#x5927;&#x7684;&#x6570;&#xFF09;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7B2C;&#x4E09;&#x8F6E;&#xFF1A;&#x2026;</p>
<p>&#x2003;&#x2003;&#x6309;&#x6B64;&#x89C4;&#x5F8B;&#x64CD;&#x4F5C;&#xFF0C;&#x76F4;&#x81F3;&#x6700;&#x7EC8;&#x5B8C;&#x6210;&#x6392;&#x5E8F;&#x3002;&#x7531;&#x4E8E;&#x5728;&#x6392;&#x5E8F;&#x8FC7;&#x7A0B;&#x4E2D;&#x603B;&#x662F;&#x5C0F;&#x6570;&#x5F80;&#x524D;&#x653E;&#xFF0C;&#x5927;&#x6570;&#x5F80;&#x540E;&#x653E;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x5C0F;&#x7684;&#x6C14;&#x6CE1;&#x5F80;&#x4E0A;&#x5347;&#xFF0C;&#x6240;&#x4EE5;&#x79F0;&#x4F5C;&#x5192;&#x6CE1;&#x6392;&#x5E8F;&#x3002;</p>
<ul>
<li>&#x76F4;&#x63A5;&#x63D2;&#x5165;&#x6392;&#x5E8F;</li>
</ul>
<p>&#x2003;&#x2003;&#x76F4;&#x63A5;&#x63D2;&#x5165;&#x6392;&#x5E8F;&#x5B58;&#x5728;&#x4E24;&#x4E2A;&#x8868;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x6709;&#x5E8F;&#x8868;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x65E0;&#x5E8F;&#x8868;&#x3002;&#x6BCF;&#x6B21;&#x4ECE;&#x65E0;&#x5E8F;&#x8868;&#x4E2D;&#x53D6;&#x51FA;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x628A;&#x5B83;&#x63D2;&#x5165;&#x5230;&#x6709;&#x5E8F;&#x8868;&#x7684;&#x5408;&#x9002;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F7F;&#x6709;&#x5E8F;&#x8868;&#x4ECD;&#x7136;&#x6709;&#x5E8F;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7B2C;&#x4E00;&#x8F6E;&#xFF1A;&#x6BD4;&#x8F83;&#x524D;&#x4E24;&#x4E2A;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x6309;&#x987A;&#x5E8F;&#x63D2;&#x5165;&#x5230;&#x6709;&#x5E8F;&#x8868;&#x4E2D;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x6570;&#x4ECD;&#x5728;&#x65E0;&#x5E8F;&#x8868;&#x4E2D;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7B2C;&#x4E8C;&#x8F6E;&#xFF1A;&#x628A;&#x65E0;&#x5E8F;&#x8868;&#x4E2D;&#x5269;&#x4E0B;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E0E;&#x6709;&#x5E8F;&#x8868;&#x7684;&#x6709;&#x5E8F;&#x6570;&#x5217;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8FD9;&#x4E2A;&#x6570;&#x63D2;&#x5165;&#x5230;&#x5408;&#x9002;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7B2C;&#x4E09;&#x8F6E;&#xFF1A;&#x2026;&#x2026;</p>
<p>&#x2003;&#x2003;&#x6309;&#x6B64;&#x89C4;&#x5F8B;&#x64CD;&#x4F5C;&#xFF0C;&#x76F4;&#x81F3;&#x65E0;&#x5E8F;&#x8868;&#x4E2D;&#x7684;&#x6570;&#x5168;&#x90E8;&#x63D2;&#x5165;&#x5230;&#x6709;&#x5E8F;&#x8868;&#xFF0C;&#x5B8C;&#x6210;&#x6392;&#x5E8F;&#x3002;</p>
<p>&#x2003;&#x2003;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x5C06;&#x518D;&#x5B66;&#x4E60;&#x4E24;&#x79CD;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x9009;&#x62E9;&#x6392;&#x5E8F;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x3002;</p>
<h3 id="1011--&#x9009;&#x62E9;&#x6392;&#x5E8F;">10.1.1  &#x9009;&#x62E9;&#x6392;&#x5E8F;</h3>
<p>&#x2003;&#x2003;&#x9009;&#x62E9;&#x6392;&#x5E8F;&#x662F;&#x5E38;&#x7528;&#x7684;&#x4E00;&#x79CD;&#x6392;&#x5E8F;&#x65B9;&#x5F0F;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x4EE5;&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x4E3A;&#x4F8B;&#x4ECB;&#x7ECD;&#x9009;&#x62E9;&#x6392;&#x5E8F;&#x3002;&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x601D;&#x8DEF;&#x7684;&#x6838;&#x5FC3;&#x662F;&#xFF1A;<em>N</em>&#xFF08;<em>N</em>&#x4E3A;&#x9700;&#x8981;&#x6392;&#x5217;&#x7684;&#x5143;&#x7D20;&#x4E2A;&#x6570;&#xFF09;&#x4ECE;1&#x5F00;&#x59CB;&#xFF0C;&#x6BCF;&#x4E00;&#x8F6E;&#x4ECE;&#x5F85;&#x6392;&#x6570;&#x5217;&#x4E2D;&#x9009;&#x62E9;&#x7B2C;<em>N</em>&#x5C0F;&#xFF08;&#x6216;&#x5927;&#xFF09;&#x7684;&#x6570;&#x653E;&#x5230;&#x6392;&#x5E8F;&#x5217;&#x8868;&#x7684;&#x7B2C;<em>N</em>&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7B2C;&#x4E00;&#x8F6E;&#xFF1A;&#x4ECE;&#x5168;&#x90E8;&#x5F85;&#x6392;&#x5E8F;&#x6570;&#x5217;&#x4E2D;&#x9009;&#x51FA;&#x6700;&#x5C0F;&#x7684;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x4E0E;&#x7B2C;1&#x4E2A;&#x4F4D;&#x7F6E;&#x7684;&#x6570;&#x8FDB;&#x884C;&#x4EA4;&#x6362;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6BCF;&#x4E8C;&#x8F6E;&#xFF1A;&#x4ECE;&#x7B2C;2&#x4E2A;&#x4F4D;&#x7F6E;&#x5230;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x4E2D;&#xFF08;&#x5F85;&#x6392;&#x5E8F;&#x6570;&#x5217;&#xFF09;&#x9009;&#x51FA;&#x6700;&#x5C0F;&#x7684;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x4E0E;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F4D;&#x7F6E;&#x7684;&#x6570;&#x8FDB;&#x884C;&#x4EA4;&#x6362;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7B2C;&#x4E09;&#x8F6E;&#xFF1A;&#x2026;</p>
<p>&#x2003;&#x2003;&#x6309;&#x6B64;&#x89C4;&#x5F8B;&#x64CD;&#x4F5C;&#xFF0C;<em>N</em>-1&#x8F6E;&#x4EE5;&#x540E;&#xFF0C;&#x5F85;&#x6392;&#x5E8F;&#x6570;&#x5217;&#x5C31;&#x53D8;&#x6210;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x7684;&#x6570;&#x5217;&#x4E86;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4F7F;&#x7528;&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x5177;&#x4F53;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>public class TestSelect{

public static void main(String[] args) {

int[] array = {65,34,74,24,89,1,58};

System.out.println(&quot;&#x6392;&#x5E8F;&#x524D;&#x7684;&#x6570;&#x7EC4;:&quot;);

for (int i = 0; i &lt; array.length; i++) {

System.out.print(array[i]+&quot;  &quot;);

}

System.out.println();

selectSort(array);//&#x4F7F;&#x7528;&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x6392;&#x5E8F;

System.out.println(&quot;&#x6392;&#x5E8F;&#x540E;&#x7684;&#x6570;&#x7EC4;:&quot;);

for (int i = 0; i &lt; array.length; i++) {

System.out.print(array[i]+&quot;  &quot;);

}

System.out.println();

}

//&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x6392;&#x5E8F;

public static void selectSort(int[] a) {

for(int i = 0; i &lt; a.length-1; i++){

int k = i;

//&#x9009;&#x62E9;&#x5F85;&#x6392;&#x5E8F;&#x6570;&#x5217;&#x4E2D;&#x6700;&#x5C0F;&#x6570;&#x7684;&#x4E0B;&#x6807;

for(int j = i; j &lt; a.length; j++){

if(a[k] &gt; a[j]){

k = j;

}

}

if(k != i){

int temp = a[i];

a[i] = a[k];

a[k] = temp;

}

}

}

}
</code></pre><p>&#x2003;&#x2003;&#x7F16;&#x8BD1;&#x3001;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD0;&#x884C;&#x7ED3;&#x679C;&#x5982;&#x56FE;10.1&#x6240;&#x793A;&#x3002;</p>
<p align="center"><img src="../img/d10z/tu10.1.png"></p>  
<p align="center">&#x56FE;10.1  &#x76F4;&#x63A5;&#x9009;&#x62E9;&#x6392;&#x5E8F;</p>  



<h3 id="1012--&#x5FEB;&#x901F;&#x6392;&#x5E8F;">10.1.2  &#x5FEB;&#x901F;&#x6392;&#x5E8F;</h3>
<p>&#x2003;&#x2003;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x662F;&#x5BF9;&#x5192;&#x6CE1;&#x6392;&#x5E8F;&#x7684;&#x4E00;&#x79CD;&#x6539;&#x8FDB;&#xFF0C;&#x5B83;&#x7684;&#x57FA;&#x672C;&#x601D;&#x60F3;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x8F6E;&#x6392;&#x5E8F;&#x5C06;&#x8981;&#x6392;&#x5E8F;&#x7684;&#x6570;&#x636E;&#x5206;&#x5272;&#x6210;&#x72EC;&#x7ACB;&#x7684;&#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x6BD4;&#x53E6;&#x5916;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x90FD;&#x8981;&#x5C0F;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6309;&#x6B64;&#x65B9;&#x6CD5;&#x5BF9;&#x8FD9;&#x4E24;&#x90E8;&#x5206;&#x6570;&#x636E;&#x5206;&#x522B;&#x8FDB;&#x884C;&#x4E00;&#x8F6E;&#x6392;&#x5E8F;&#xFF0C;&#x6574;&#x4E2A;&#x6392;&#x5E8F;&#x8F6E;&#x6B21;&#x9012;&#x5F52;&#x8FDB;&#x884C;&#xFF0C;&#x4F7F;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x6709;&#x5E8F;&#x5E8F;&#x5217;&#x3002;
&#x6BCF;&#x8F6E;&#x6392;&#x5E8F;&#x7684;&#x5177;&#x4F53;&#x7B97;&#x6CD5;&#x5982;&#x4E0B;&#xFF1A;  </p>
<p>&#x2003;&#x2003;&#xFF08;1&#xFF09;&#x8BBE;&#x7F6E;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;i&#x3001;j&#xFF08;&#x5747;&#x4E3A;&#x4E0B;&#x6807;&#x53D8;&#x91CF;&#xFF09;&#xFF0C;&#x6392;&#x5E8F;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;i=0&#xFF0C;j=N-1&#x3002;  </p>
<p>&#x2003;&#x2003;&#xFF08;2&#xFF09;&#x4EE5;&#x7B2C;&#x4E00;&#x4E2A;&#x636E;&#x5143;&#x7D20;&#x4F5C;&#x4E3A;&#x5173;&#x952E;&#x6570;&#x636E;&#xFF0C;&#x8D4B;&#x503C;&#x7ED9;key&#xFF0C;&#x5373;key=a[0]&#x3002;  </p>
<p>&#x2003;&#x2003;&#xFF08;3&#xFF09;&#x4ECE;<em>j</em>&#x5F00;&#x59CB;&#x5411;&#x524D;&#x641C;&#x7D22;<em>j</em>--&#xFF0C;&#x5373;&#x7531;&#x540E;&#x5F00;&#x59CB;&#x5411;&#x524D;&#x641C;&#x7D22;&#xFF0C;&#x627E;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x5C0F;&#x4E8E;key&#x7684;&#x503C;a[j]&#xFF0C;a[i]&#x4E0E;a[j]&#x4EA4;&#x6362;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;4&#xFF09;&#x4ECE;<em>i</em>&#x5F00;&#x59CB;&#x5411;&#x540E;&#x641C;&#x7D22;<em>i</em>++&#xFF0C;&#x5373;&#x7531;&#x524D;&#x5F00;&#x59CB;&#x5411;&#x540E;&#x641C;&#x7D22;&#xFF0C;&#x627E;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x5927;&#x4E8E;key&#x7684;a[i]&#xFF0C;a[i]&#x4E0E;a[j]&#x4EA4;&#x6362;&#x3002;</p>
<p>&#x2003;&#x2003;&#x91CD;&#x590D;&#x6B65;&#x9AA4;&#xFF08;3&#xFF09;&#x548C;&#x6B65;&#x9AA4;&#xFF08;4&#xFF09;&#xFF0C;&#x76F4;&#x5230;<em>i</em>=<em>j</em>&#xFF0C;&#x5219;&#x5C06;&#x5C0F;&#x4E8E;key&#x7684;&#x6570;&#x5168;&#x90E8;&#x90FD;&#x653E;&#x5728;key&#x524D;&#xFF0C;&#x5C06;&#x5927;&#x4E8E;key&#x7684;&#x6570;&#x90FD;&#x653E;&#x5728;&#x4E86;key&#x540E;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x7684;&#x7B97;&#x6CD5;&#x5728;&#x7406;&#x89E3;&#x4E0A;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x5B9A;&#x96BE;&#x5EA6;&#x7684;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x901A;&#x8FC7;&#x6267;&#x884C;&#x4E00;&#x8F6E;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x6765;&#x5BF9;array{58,34,65,89,74,1,24}&#x6570;&#x7EC4;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x3002;</p>
<p>&#x2003;&#x2003;array&#x6570;&#x7EC4;&#x6392;&#x5E8F;&#x524D;&#x7684;&#x5E8F;&#x5217;&#x5982;&#x4E0B;&#xFF1A;</p>
<table align="center">
    <tr>
        <td>58</td>
        <td>34</td>
        <td>65</td>
        <td>89</td>
        <td>74</td>
        <td>1</td>
        <td>24</td>
    </tr>
</table>





<p>&#x2003;&#x2003;&#x9009;&#x62E9;&#x521D;&#x59CB;&#x5173;&#x952E;&#x6570;&#x636E;key=58&#xFF08;&#x6CE8;&#x610F;&#x5173;&#x952E;key&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x603B;&#x662F;&#x548C;key&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x6700;&#x540E;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x628A;key&#x653E;&#x5728;&#x4E2D;&#x95F4;&#xFF0C;&#x5C0F;&#x7684;&#x653E;&#x524D;&#x9762;&#xFF0C;&#x5927;&#x7684;&#x653E;&#x540E;&#x9762;&#xFF09;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7B2C;&#x4E00;&#x6B21;&#x4EA4;&#x6362;&#xFF1A;&#x4ECE;&#x6700;&#x540E;&#x7684;&#x6570;24&#x5F00;&#x59CB;&#x641C;&#x7D22;&#xFF0C;&#x627E;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x5C0F;&#x4E8E;58&#x7684;&#x6570;24&#xFF08;&#x6B64;&#x65F6;<em>j</em>=6&#xFF09;&#xFF0C;&#x5C06;58&#x548C;24&#x8FDB;&#x884C;&#x4EA4;&#x6362;&#xFF0C;&#x4EA4;&#x6362;&#x540E;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;</p>
<table align="center">
    <tr>
        <td>24</td>
        <td>34</td>
        <td>65</td>
        <td>89</td>
        <td>74</td>
        <td>1</td>
        <td>58</td>
    </tr>
</table>




<p>&#x2003;&#x2003;&#x7B2C;&#x4E8C;&#x6B21;&#x4EA4;&#x6362;&#xFF1A;&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x6570;24&#x5F00;&#x59CB;&#x641C;&#x7D22;&#xFF0C;&#x627E;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x5927;&#x4E8E;58&#x7684;&#x6570;65&#xFF08;&#x6B64;&#x65F6;<em>i</em>=2&#xFF09;&#xFF0C;&#x5C06;58&#x548C;65&#x8FDB;&#x884C;&#x4EA4;&#x6362;&#xFF0C;&#x4EA4;&#x6362;&#x540E;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;</p>
<table align="center">
    <tr>
        <td>24</td>
        <td>34</td>
        <td>58</td>
        <td>89</td>
        <td>74</td>
        <td>1</td>
        <td>65</td>
    </tr>
</table>




<p>&#x2003;&#x2003;&#x7B2C;&#x4E09;&#x6B21;&#x4EA4;&#x6362;&#xFF1A;&#x4ECE;&#x6700;&#x540E;&#x7684;&#x6570;65&#x5F00;&#x59CB;&#x641C;&#x7D22;&#xFF0C;&#x627E;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x5C0F;&#x4E8E;58&#x7684;&#x6570;1&#xFF08;&#x6B64;&#x65F6;<em>j</em>=5&#xFF09;&#xFF0C;&#x5C06;58&#x548C;1&#x8FDB;&#x884C;&#x4EA4;&#x6362;&#xFF0C;&#x4EA4;&#x6362;&#x540E;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;</p>
<table align="center">
    <tr>
        <td>24</td>
        <td>34</td>
        <td>1</td>
        <td>89</td>
        <td>74</td>
        <td>58</td>
        <td>65</td>
    </tr>
</table>




<p>&#x2003;&#x2003;&#x7B2C;&#x56DB;&#x6B21;&#x4EA4;&#x6362;&#xFF1A;&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x6570;24&#x5F00;&#x59CB;&#x641C;&#x7D22;&#xFF0C;&#x627E;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x5927;&#x4E8E;58&#x7684;&#x6570;89&#xFF08;&#x6B64;&#x65F6;<em>i</em>=3&#xFF09;&#xFF0C;&#x5C06;58&#x548C;89&#x8FDB;&#x884C;&#x4EA4;&#x6362;&#xFF0C;&#x4EA4;&#x6362;&#x540E;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;</p>
<table align="center">
    <tr>
        <td>24</td>
        <td>34</td>
        <td>1</td>
        <td>58</td>
        <td>74</td>
        <td>89</td>
        <td>65</td>
    </tr>
</table>




<p>&#x2003;&#x2003;&#x518D;&#x5F80;&#x4E0B;&#x6267;&#x884C;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x4EA4;&#x6362;&#x6570;&#x636E;&#x524D;&#x5373;&#x51FA;&#x73B0;&#x4E86;<em>i</em>&#x548C;<em>j</em>&#x7684;&#x6570;&#x503C;&#x90FD;&#x4E3A;4&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6EE1;&#x8DB3;&#x7B2C;&#x4E00;&#x8F6E;&#x9000;&#x51FA;&#x6761;&#x4EF6;&#x3002;&#x89C2;&#x5BDF;&#x6392;&#x5E8F;&#x540E;&#x7684;&#x6570;&#x5E8F;&#xFF0C;&#x53D1;&#x73B0;&#x5C0F;&#x4E8E;58&#x7684;&#x6570;&#x90FD;&#x6392;&#x5230;&#x4E86;58&#x7684;&#x524D;&#x9762;&#xFF0C;&#x5927;&#x4E8E;58&#x7684;&#x6570;&#x90FD;&#x6392;&#x5230;&#x4E86;58&#x7684;&#x540E;&#x9762;&#x3002;&#x518D;&#x6309;&#x6B64;&#x65B9;&#x6CD5;&#x5BF9;&#x524D;&#x540E;&#x4E24;&#x90E8;&#x5206;&#x6570;&#x636E;&#x5206;&#x522B;&#x8FDB;&#x884C;&#x4E00;&#x8F6E;&#x6392;&#x5E8F;&#xFF0C;&#x8FD9;&#x6837;&#x9012;&#x5F52;&#x4E0B;&#x53BB;&#xFF0C;&#x8FBE;&#x5230;&#x6392;&#x5E8F;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4F7F;&#x7528;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x7684;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF08;&#x8BF7;&#x5927;&#x5BB6;&#x8BA4;&#x771F;&#x9605;&#x8BFB;&#x6CE8;&#x91CA;&#xFF0C;&#x7406;&#x89E3;&#x4EE3;&#x7801;&#x7684;&#x542B;&#x4E49;&#xFF09;&#xFF1A;</p>
<pre><code>public class TestQuick

{

public static void main(String[] ary)

{

int[] array = {65,34,58,89,74,1,24};

System.out.println(&quot;&#x6392;&#x5E8F;&#x524D;&#x7684;&#x6570;&#x7EC4;:&quot;);

for (int i = 0; i &lt; array.length; i++) {

System.out.print(array[i]+&quot;  &quot;);

}

System.out.println();

sort(array, 0, array.length - 1);//&#x4F7F;&#x7528;&#x5FEB;&#x901F;&#x6392;&#x5E8F;

System.out.println(&quot;&#x6392;&#x5E8F;&#x540E;&#x7684;&#x6570;&#x7EC4;:&quot;);

for (int i = 0; i &lt; array.length; i++) {

System.out.print(array[i]+&quot;  &quot;);

}

System.out.println();

}

//&#x8FDB;&#x884C;&#x4E00;&#x8F6E;&#x6392;&#x5E8F;&#xFF0C;array&#x4E3A;&#x6392;&#x5E8F;&#x6570;&#x7EC4;&#xFF0C;i&#xFF0C;j&#x4E3A;&#x6392;&#x5E8F;&#x8D77;&#x59CB;&#x548C;&#x7ED3;&#x675F;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD4;&#x56DE;&#x5173;&#x952E;&#x6570;&#x636E;&#x6392;&#x5E8F;&#x540E;&#x7D22;&#x5F15;

private static int sortUnit(int[] array, int i, int j)

{

int key = array[i];

while (i &lt; j)

{

//&#x4ECE;&#x540E;&#x5411;&#x524D;&#x641C;&#x7D22;&#x6BD4;key&#x5C0F;&#x7684;&#x503C;&#xFF0C;&#x6BD4;key&#x5C0F;&#x7684;&#x653E;&#x5DE6;&#x8FB9;

while(array[j] &gt;= key &amp;&amp; j &gt; i)

j--;

//&#x4EA4;&#x6362;

array[i] = array[j];

//&#x4ECE;&#x524D;&#x5411;&#x540E;&#x641C;&#x7D22;&#x6BD4;key&#x5927;&#x7684;&#x503C;&#xFF0C;&#x6BD4;key&#x5927;&#x7684;&#x653E;&#x53F3;&#x8FB9;

while (array[i] &lt;= key &amp;&amp; j &gt; i)

i++;

//&#x4EA4;&#x6362;

array[j] = array[i];

}

//&#x5F53;i=j&#x65F6;&#xFF0C;&#x4E00;&#x8F6E;&#x6392;&#x5E8F;&#x7ED3;&#x675F;

array[j] = key;

//&#x8FD4;&#x56DE;&#x5173;&#x952E;&#x6570;&#x636E;&#x6392;&#x5E8F;&#x540E;&#x7D22;&#x5F15;

return j;

}

//&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#xFF0C;&#x9012;&#x5F52;&#x8C03;&#x7528;

public static void sort(int[] array, int low, int high)

{

if (low &gt;= high)

{

return;

}

//&#x5B8C;&#x6210;&#x4E00;&#x8F6E;&#x6392;&#x5E8F;

int index = sortUnit(array, low, high);

//&#x5BF9;&#x5DE6;&#x8FB9;&#x90E8;&#x5206;&#x8FDB;&#x884C;&#x6392;&#x5E8F;

sort(array, low, index - 1);

//&#x5BF9;&#x53F3;&#x8FB9;&#x90E8;&#x5206;&#x8FDB;&#x884C;&#x6392;&#x5E8F;

sort(array, index + 1, high);

}

}
</code></pre><p>&#x2003;&#x2003;&#x7F16;&#x8BD1;&#x3001;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD0;&#x884C;&#x7ED3;&#x679C;&#x5982;&#x56FE;10.2&#x6240;&#x793A;&#x3002;</p>
<p align="center"><img src="../img/d10z/tu10.2.png"></p>  
<p align="center">&#x56FE;10.2  &#x5FEB;&#x901F;&#x6392;&#x5E8F;</p>  










<h2 id="102--&#x4E0A;&#x673A;&#x4EFB;&#x52A1;">10.2  &#x4E0A;&#x673A;&#x4EFB;&#x52A1;</h2>
<h4 id="&#x76EE;&#x6807;&#xFF1A;&#x5B8C;&#x6210;&#x672C;&#x7AE0;101&#x8282;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x7A0B;&#x5E8F;&#x3002;">&#x76EE;&#x6807;&#xFF1A;&#x5B8C;&#x6210;&#x672C;&#x7AE0;10.1&#x8282;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x7A0B;&#x5E8F;&#x3002;</h4>
<p>&#x65F6;&#x95F4;&#xFF1A;40&#x5206;&#x949F;&#x3002;</p>
<p>&#x5F62;&#x5F0F;&#xFF1A;&#x6BCF;&#x4E2A;&#x5B66;&#x5458;&#x72EC;&#x7ACB;&#x5B8C;&#x6210;&#xFF0C;&#x5C0F;&#x7EC4;&#x7EC4;&#x957F;&#x68C0;&#x67E5;&#x3002;</p>
<p>&#x5DE5;&#x5177;&#xFF1A;EditPlus&#x3002;</p>
<h2 id="103--&#x5E38;&#x89C1;&#x6BD4;&#x8F83;">10.3  &#x5E38;&#x89C1;&#x6BD4;&#x8F83;</h2>
<p>&#x2003;&#x2003;&#x5728;&#x9762;&#x8BD5;&#x65F6;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x6D89;&#x53CA;&#x76F8;&#x4F3C;&#x77E5;&#x8BC6;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x6BD4;&#x8F83;&#x3002;&#x5728;&#x5E73;&#x65F6;&#x7684;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7559;&#x610F;&#x5E76;&#x533A;&#x5206;&#x76F8;&#x4F3C;&#x6280;&#x672F;&#x7684;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#xFF0C;&#x53EF;&#x4EE5;&#x52A0;&#x6DF1;&#x5BF9;&#x77E5;&#x8BC6;&#x7684;&#x638C;&#x63E1;&#x3002;&#x672C;&#x5C0F;&#x8282;&#xFF0C;&#x5C06;&#x4F1A;&#x901A;&#x8FC7;&#x51E0;&#x4E2A;&#x77E5;&#x8BC6;&#x7684;&#x5BF9;&#x6BD4;&#xFF0C;&#x629B;&#x7816;&#x5F15;&#x7389;&#xFF0C;&#x5E0C;&#x671B;&#x5F15;&#x8D77;&#x5927;&#x5BB6;&#x7684;&#x91CD;&#x89C6;&#x3002;</p>
<h3 id="1031--hashmap&#x4E0E;hashtable">10.3.1  HashMap&#x4E0E;Hashtable</h3>
<p>&#x2003;&#x2003;HashMap&#x662F;Hashtable&#x7684;&#x8F7B;&#x91CF;&#x7EA7;&#x5B9E;&#x73B0;&#xFF0C;&#x4E8C;&#x8005;&#x5747;&#x5B9E;&#x73B0;&#x4E86;Map&#x501F;&#x53E3;&#xFF0C;&#x4E3B;&#x8981;&#x6709;&#x4EE5;&#x4E0B;&#x4E09;&#x70B9;&#x533A;&#x522B;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;1&#xFF09;Hashtable&#x76F4;&#x63A5;&#x7EE7;&#x627F;&#x81EA;Dictionary&#x62BD;&#x8C61;&#x7C7B;&#xFF0C;&#x5176;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#x4E5F;&#x662F;&#x57FA;&#x4E8E;Dictionary&#x7C7B;&#x7684;&#xFF1B;&#x800C;HashMap&#x5219;&#x662F;JDK1.2&#x5F15;&#x8FDB;&#x7684;Map&#x63A5;&#x53E3;&#x7684;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x7C7B;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;2&#xFF09;Hashtable&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF08;&#x540C;&#x6B65;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x6548;&#x7387;&#x8F83;&#x4F4E;&#xFF1B;&#x800C;HashMap&#x662F;&#x7EBF;&#x7A0B;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#xFF08;&#x5F02;&#x6B65;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x6548;&#x7387;&#x8F83;&#x9AD8;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;3&#xFF09;Hashtable&#x4E0D;&#x5141;&#x8BB8;&#x5C06;null&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;entry&#x7684;key&#x6216;value&#xFF0C;&#x4F46;HashMap&#x5141;&#x8BB8;&#x3002;</p>
<h3 id="1032--arraylist&#x4E0E;linkedlist">10.3.2  ArrayList&#x4E0E;LinkedList</h3>
<p>&#x2003;&#x2003;ArrayList&#x662F;&#x57FA;&#x4E8E;&#x52A8;&#x6001;&#x6570;&#x7EC4;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x800C;LinkedList&#x57FA;&#x4E8E;&#x94FE;&#x8868;&#x3002;</p>
<p>&#x2003;&#x2003;&#x56E0;&#x6B64;&#xFF0C;&#x5BF9;&#x4E8E;&#x968F;&#x673A;&#x8BBF;&#x95EE;(get&#x548C;set)&#xFF0C;ArrayList&#x7684;&#x6548;&#x7387;&#x9AD8;&#x4E8E;LinkedList&#xFF1B;&#x800C;&#x5BF9;&#x4E8E;&#x589E;&#x52A0;&#x548C;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#xFF08;add&#x548C;remove&#xFF09;&#xFF0C;LinedList&#x7684;&#x6548;&#x7387;&#x9AD8;&#x4E8E;ArrayList&#x3002;</p>
<p>&#x2003;&#x2003;&#x6B64;&#x5916;&#xFF0C;ArrayList&#x548C;LinkedList&#x90FD;&#x662F;&#x7EBF;&#x7A0B;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<h3 id="1033--list&#x3001;map&#x4E0E;set">10.3.3  List&#x3001;Map&#x4E0E;Set</h3>
<p>&#x2003;&#x2003;List&#x63A5;&#x53E3;&#x548C;Set&#x63A5;&#x53E3;&#x6709;&#x5171;&#x540C;&#x7684;&#x7236;&#x7C7B;&#xFF1A;Collection&#x63A5;&#x53E3;&#xFF1B;&#x800C;Map&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x9876;&#x7EA7;&#x63A5;&#x53E3;&#x3002;</p>
<p>&#x2003;&#x2003;Collection&#x63A5;&#x53E3;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x4E00;&#x7EC4;&#x4E0D;&#x552F;&#x4E00;&#x3001;&#x65E0;&#x5E8F;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;List&#x63A5;&#x53E3;&#x5B58;&#x50A8;&#x4E00;&#x7EC4;&#x4E0D;&#x552F;&#x4E00;&#x3001;&#x6709;&#x5E8F;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;Set&#x63A5;&#x53E3;&#x5B58;&#x50A8;&#x4E00;&#x7EC4;&#x552F;&#x4E00;&#x3001;&#x65E0;&#x5E8F;&#x7684;&#x5BF9;&#x8C61;&#xFF1B;&#x800C;Map&#x63A5;&#x53E3;&#x5B58;&#x50A8;&#x7684;&#x662F;&#x4E00;&#x7EC4;&#x952E;&#x503C;&#x5BF9;&#x8C61;&#xFF08;entry&#x5BF9;&#x8C61;&#xFF09;&#xFF0C;&#x5E76;&#x63D0;&#x9AD8;&#x4ECE;key&#x5230;value&#x7684;&#x6620;&#x5C04;&#x3002;</p>
<h2 id="104--&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;">10.4  &#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;</h2>
<p>&#x2003;&#x2003;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x662F;&#x6700;&#x8FD1;&#x6570;&#x5341;&#x5E74;&#x8F6F;&#x4EF6;&#x4F01;&#x4E1A;&#x4E00;&#x76F4;&#x6BD4;&#x8F83;&#x5173;&#x5FC3;&#x7684;&#x8BDD;&#x9898;&#x4E4B;&#x4E00;&#xFF0C;&#x662F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x53EF;&#x7F3A;&#x5C11;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5BF9;&#x4E8E;&#x53D1;&#x73B0;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x3001;&#x4FDD;&#x8BC1;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x8D28;&#x91CF;&#x5177;&#x6709;&#x4E0D;&#x53EF;&#x66FF;&#x4EE3;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x672C;&#x5C0F;&#x8282;&#x5C06;&#x4ECB;&#x7ECD;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x7684;&#x6982;&#x5FF5;&#x4EE5;&#x53CA;&#x6D4B;&#x8BD5;&#x4E0E;&#x8C03;&#x8BD5;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x4F7F;&#x5927;&#x5BB6;&#x5BF9;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x6709;&#x4E2A;&#x521D;&#x6B65;&#x7684;&#x4E86;&#x89E3;&#x3002;</p>
<h3 id="1041--&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x6982;&#x8FF0;">10.4.1  &#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x6982;&#x8FF0;</h3>
<h4 id="1&#xFF0E;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x7684;&#x6982;&#x5FF5;">1&#xFF0E;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x7684;&#x6982;&#x5FF5;</h4>
<p>&#x2003;&#x2003;&#x300A;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x7684;&#x827A;&#x672F;&#x300B;&#x662F;&#x5173;&#x4E8E;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x7684;&#x4E00;&#x672C;&#x7ECF;&#x5178;&#x8457;&#x4F5C;&#xFF0C;&#x5176;&#x4F5C;&#x8005;Glenford J. Myers&#x66FE;&#x7ECF;&#x5BF9;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x8FDB;&#x884C;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x5B9A;&#x4E49;&#xFF1A;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x53D1;&#x73B0;&#x9519;&#x8BEF;&#x800C;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x6216;&#x8005;&#x7CFB;&#x7EDF;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x4E00;&#x5B9A;&#x4E49;&#x660E;&#x786E;&#x4E86;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x7684;&#x6839;&#x672C;&#x76EE;&#x7684;&#x662F;&#x53D1;&#x73B0;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x2003;&#x2003;Myers&#x64B0;&#x5199;&#x8BE5;&#x8457;&#x4F5C;&#x7684;&#x65F6;&#x671F;&#x662F;&#x5728;20&#x4E16;&#x7EAA;70&#x5E74;&#x4EE3;&#x672B;&#x671F;&#xFF0C;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x901A;&#x5E38;&#x5728;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x5F00;&#x53D1;&#x7684;&#x540E;&#x671F;&#x5F00;&#x59CB;&#xFF0C;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x5BFB;&#x627E;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x7F3A;&#x9677;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4ED6;&#x5BF9;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x6240;&#x4E0B;&#x7684;&#x8FD9;&#x4E00;&#x5B9A;&#x4E49;&#x88AB;&#x4EBA;&#x4EEC;&#x5E7F;&#x6CDB;&#x63A5;&#x53D7;&#xFF0C;&#x53CD;&#x6620;&#x4E86;&#x4EBA;&#x4EEC;&#x5728;&#x5F53;&#x65F6;&#x5BF9;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x6240;&#x6301;&#x7684;&#x89C2;&#x70B9;&#x3002;</p>
<p>&#x2003;&#x2003;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x4EE5;&#x53CA;&#x884C;&#x4E1A;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x4EBA;&#x4EEC;&#x9010;&#x6E10;&#x53D1;&#x73B0;&#x4E86;&#x5176;&#x5B9A;&#x4E49;&#x4E2D;&#x7684;&#x4E0D;&#x8DB3;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x5728;20&#x4E16;&#x7EAA;80&#x5E74;&#x4EE3;&#x4E2D;&#x671F;&#xFF0C;&#x5728;IEEE&#x63D0;&#x51FA;&#x7684;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x6807;&#x51C6;&#x672F;&#x8BED;&#x4E2D;&#xFF0C;&#x8C03;&#x6574;&#x4E86;&#x5BF9;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x5373;&#x4F7F;&#x7528;&#x4EBA;&#x5DE5;&#x6216;&#x81EA;&#x52A8;&#x624B;&#x6BB5;&#x6765;&#x8FD0;&#x884C;&#x6216;&#x6D4B;&#x8BD5;&#x67D0;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5176;&#x76EE;&#x7684;&#x5728;&#x4E8E;&#x68C0;&#x9A8C;&#x5B83;&#x662F;&#x5426;&#x6EE1;&#x8DB3;&#x89C4;&#x5B9A;&#x7684;&#x9700;&#x6C42;&#x6216;&#x5F04;&#x6E05;&#x9884;&#x671F;&#x7ED3;&#x679C;&#x4E0E;&#x5B9E;&#x9645;&#x7ED3;&#x679C;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x522B;&#x3002;</p>
<p>&#x2003;&#x2003;&#x66F4;&#x65B0;&#x540E;&#x7684;&#x5B9A;&#x4E49;&#x9664;&#x5438;&#x6536;&#x4E86;&#x4E4B;&#x524D;&#x4EBA;&#x4EEC;&#x5BF9;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5B9A;&#x4E49;&#x4E2D;&#x7684;&#x7CBE;&#x534E;&#x5916;&#xFF0C;&#x8FD8;&#x660E;&#x786E;&#x6307;&#x51FA;&#xFF0C;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x4F5C;&#x4E3A;&#x4FDD;&#x8BC1;&#x8F6F;&#x4EF6;&#x8D28;&#x91CF;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x624B;&#x6BB5;&#xFF0C;&#x5176;&#x4E3B;&#x8981;&#x4EFB;&#x52A1;&#x662F;&#x5728;&#x5DF2;&#x8BBE;&#x8BA1;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x68C0;&#x9A8C;&#x8F6F;&#x4EF6;&#x5404;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x4EE5;&#x53CA;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3001;&#x5B8C;&#x6574;&#x5730;&#x5B9E;&#x73B0;&#x4E86;&#x9884;&#x5B9A;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x8F6F;&#x4EF6;&#x8D28;&#x91CF;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4ECA;&#x5929;&#xFF0C;&#x4EBA;&#x4EEC;&#x5BF9;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x6709;&#x4E86;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x4ECE;&#x5E7F;&#x4E49;&#x4E0A;&#x8BB2;&#xFF0C;&#x6D4B;&#x8BD5;&#x662F;&#x6307;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x751F;&#x5B58;&#x5468;&#x671F;&#x5185;&#x6240;&#x6709;&#x7684;&#x68C0;&#x67E5;&#x3001;&#x8BC4;&#x5BA1;&#x548C;&#x786E;&#x8BA4;&#x6D3B;&#x52A8;&#x3002;&#x4F8B;&#x5982;&#x8BBE;&#x8BA1;&#x8BC4;&#x5BA1;&#x3001;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3001;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x7B49;&#x3002;&#x4ECE;&#x72ED;&#x4E49;&#x4E0A;&#x8BB2;&#xFF0C;&#x6D4B;&#x8BD5;&#x662F;&#x5BF9;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x8D28;&#x91CF;&#x7684;&#x68C0;&#x9A8C;&#x548C;&#x8BC4;&#x4EF7;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5982;&#x4ECA;&#xFF0C;&#x8F6F;&#x4EF6;&#x884C;&#x4E1A;&#x7684;&#x4EBA;&#x5458;&#x5BF9;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x6709;&#x5982;&#x4E0B;&#x76F4;&#x89C2;&#x7684;&#x8BA4;&#x8BC6;&#x3002;</p>
<ul>
<li><p>&#x4FDD;&#x8BC1;&#x7A0B;&#x5E8F;&#x548C;&#x9700;&#x6C42;&#x89C4;&#x683C;&#x8BF4;&#x660E;&#x4E66;&#x7B49;&#x5176;&#x4ED6;&#x6587;&#x6863;&#x4E00;&#x81F4;&#x3002;</p>
</li>
<li><p>&#x53D1;&#x73B0;&#x8F6F;&#x4EF6;&#x4E2D;&#x7684;&#x7F3A;&#x9677;&#xFF0C;&#x786E;&#x4FDD;&#x7CFB;&#x7EDF;&#x80FD;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x3002;</p>
</li>
<li><p>&#x505A;&#x8F6F;&#x4EF6;&#x5E94;&#x8BE5;&#x505A;&#x7684;&#x4E8B;&#xFF0C;&#x4E0D;&#x505A;&#x8F6F;&#x4EF6;&#x4E0D;&#x5E94;&#x8BE5;&#x505A;&#x7684;&#x4E8B;&#x3002;</p>
</li>
</ul>
<p>&#x2003;&#x2003;&#x73B0;&#x4EE3;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x6D3B;&#x52A8;&#x4E00;&#x822C;&#x5305;&#x542B;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#xFF1A;</p>
<p>&#x2003;&#x2003;&#xFF08;1&#xFF09;&#x7F16;&#x5199;&#x6D4B;&#x8BD5;&#x8BA1;&#x5212;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;2&#xFF09;&#x8BBE;&#x8BA1;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;3&#xFF09;&#x5B9E;&#x65BD;&#x6D4B;&#x8BD5;&#xFF0C;&#x63D0;&#x4EA4;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;4&#xFF09;&#x6D4B;&#x8BD5;&#x8BC4;&#x4F30;&#x548C;&#x603B;&#x7ED3;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x4E0E;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x5176;&#x4ED6;&#x5DE5;&#x4F5C;&#x5728;&#x6027;&#x8D28;&#x4E0A;&#x5B58;&#x5728;&#x5F88;&#x5927;&#x7684;&#x5DEE;&#x5F02;&#x3002;&#x5176;&#x4ED6;&#x5DE5;&#x4F5C;&#x5F80;&#x5F80;&#x662F;&#x201C;&#x5EFA;&#x8BBE;&#x6027;&#x201D;&#x7684;&#xFF0C;&#x800C;&#x6D4B;&#x8BD5;&#x5DE5;&#x4F5C;&#x5374;&#x6709;&#x7740;&#x5F88;&#x5927;&#x7684;&#x201C;&#x7834;&#x574F;&#x6027;&#x201D;&#xFF0C;&#x52AA;&#x529B;&#x8BC1;&#x660E;&#x7A0B;&#x5E8F;&#x4E2D;&#x6709;&#x9519;&#x8BEF;&#xFF0C;&#x4E0D;&#x80FD;&#x6309;&#x7167;&#x7528;&#x6237;&#x7684;&#x8981;&#x6C42;&#x6B63;&#x786E;&#x5DE5;&#x4F5C;&#x3002;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x7684;&#x6839;&#x672C;&#x76EE;&#x7684;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x5E76;&#x6392;&#x9664;&#x6F5C;&#x5728;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x6700;&#x7EC8;&#x628A;&#x4E00;&#x4E2A;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x4EA4;&#x7ED9;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x3002;</p>
<h4 id="2&#xFF0E;&#x6D4B;&#x8BD5;&#x4E0E;&#x8C03;&#x8BD5;">2&#xFF0E;&#x6D4B;&#x8BD5;&#x4E0E;&#x8C03;&#x8BD5;</h4>
<p>&#x2003;&#x2003;&#x6709;&#x4E0D;&#x5C11;&#x5BF9;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x4E0D;&#x4E86;&#x89E3;&#x7684;&#x4EBA;&#x4F1A;&#x8BA4;&#x4E3A;&#x6D4B;&#x8BD5;&#x548C;&#x8C03;&#x8BD5;&#x662F;&#x4E00;&#x56DE;&#x4E8B;&#xFF0C;&#x800C;&#x5B9E;&#x9645;&#x4E0A;&#x6D4B;&#x8BD5;&#x4E0E;&#x8C03;&#x8BD5;&#x6709;&#x672C;&#x8D28;&#x7684;&#x533A;&#x522B;&#x3002;&#x7B80;&#x5355;&#x5730;&#x8BF4;&#xFF0C;&#x6D4B;&#x8BD5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x662F;&#x627E;&#x7F3A;&#x9677;&#xFF0C;&#x800C;&#x8C03;&#x8BD5;&#x7684;&#x76EE;&#x7684;&#x662F;&#x89E3;&#x51B3;&#x7F3A;&#x9677;&#x3002;&#x8F6F;&#x4EF6;&#x8C03;&#x8BD5;&#x4E0E;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x4E0D;&#x540C;&#xFF0C;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x53D1;&#x73B0;&#x8F6F;&#x4EF6;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x800C;&#x8FDB;&#x4E00;&#x6B65;&#x8BCA;&#x65AD;&#x548C;&#x6539;&#x6B63;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#x624D;&#x662F;&#x8C03;&#x8BD5;&#x7684;&#x4EFB;&#x52A1;&#x3002;</p>
<p>&#x2003;&#x2003;&#x901A;&#x5E38;&#xFF0C;&#x8C03;&#x8BD5;&#x662F;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x5F88;&#x5F3A;&#x6280;&#x5DE7;&#x6027;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x5206;&#x6790;&#x7A0B;&#x5E8F;&#x9519;&#x8BEF;&#x65F6;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x8F6F;&#x4EF6;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x5F80;&#x5F80;&#x53EA;&#x662F;&#x6F5C;&#x5728;&#x9519;&#x8BEF;&#x7684;&#x5916;&#x90E8;&#x8868;&#x73B0;&#xFF0C;&#x800C;&#x5916;&#x90E8;&#x8868;&#x73B0;&#x4E0E;&#x5185;&#x5728;&#x539F;&#x56E0;&#x4E4B;&#x95F4;&#x5E38;&#x5E38;&#x7F3A;&#x4E4F;&#x660E;&#x663E;&#x7684;&#x8054;&#x7CFB;&#x3002;&#x8981;&#x627E;&#x51FA;&#x771F;&#x6B63;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6392;&#x9664;&#x6F5C;&#x5728;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x8C03;&#x8BD5;&#x662F;&#x901A;&#x8FC7;&#x73B0;&#x8C61;&#x627E;&#x51FA;&#x539F;&#x56E0;&#x7684;&#x4E00;&#x4E2A;&#x601D;&#x7EF4;&#x5206;&#x6790;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x2003;&#x2003;&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x4E24;&#x70B9;&#x4E5F;&#x662F;&#x6D4B;&#x8BD5;&#x548C;&#x8C03;&#x8BD5;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x4E00;&#x662F;&#x6D4B;&#x8BD5;&#x662F;&#x8D2F;&#x7A7F;&#x5728;&#x6574;&#x4E2A;&#x8F6F;&#x4EF6;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x7684;&#xFF0C;&#x5305;&#x62EC;&#x9700;&#x6C42;&#x5206;&#x6790;&#x3001;&#x6982;&#x8981;&#x8BBE;&#x8BA1;&#x3001;&#x8BE6;&#x7EC6;&#x8BBE;&#x8BA1;&#x3001;&#x7F16;&#x7801;&#x3001;&#x6D4B;&#x8BD5;&#x548C;&#x8FD0;&#x884C;&#x7EF4;&#x62A4;&#x7684;&#x5168;&#x8FC7;&#x7A0B;&#xFF0C;&#x800C;&#x8C03;&#x8BD5;&#x4E3B;&#x8981;&#x5728;&#x5F00;&#x53D1;&#x9636;&#x6BB5;&#xFF0C;&#x5C24;&#x5176;&#x5728;&#x5F00;&#x53D1;&#x7684;&#x4E2D;&#x540E;&#x671F;&#x3002;&#x4E8C;&#x662F;&#x6D4B;&#x8BD5;&#x7684;&#x6267;&#x884C;&#x8005;&#x662F;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x548C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x800C;&#x8C03;&#x8BD5;&#x4EC5;&#x7531;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5B8C;&#x6210;&#xFF0C;&#x4E00;&#x822C;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x4E0D;&#x53C2;&#x4E0E;&#x3002;</p>
<h3 id="1042--&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x53CA;&#x5904;&#x7406;&#x6D41;&#x7A0B;">10.4.2  &#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x53CA;&#x5904;&#x7406;&#x6D41;&#x7A0B;</h3>
<p>&#x2003;&#x2003;&#x5728;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x53D1;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x3001;&#x9519;&#x8BEF;&#xFF0C;&#x5C31;&#x662F;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#xFF0C;&#x901A;&#x5E38;&#x4E5F;&#x79F0;&#x4E3A;Bug&#x3002;&#x672C;&#x8282;&#x5C06;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x786E;&#x5B9A;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x4EE5;&#x53CA;&#x4F5C;&#x4E3A;&#x4E00;&#x540D;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x5982;&#x4F55;&#x6709;&#x6548;&#x5730;&#x8BB0;&#x5F55;&#x7F3A;&#x9677;&#x3002;</p>
<h4 id="1&#xFF0E;&#x786E;&#x5B9A;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;">1&#xFF0E;&#x786E;&#x5B9A;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;</h4>
<p>&#x2003;&#x2003;&#x901A;&#x5E38;&#x4EBA;&#x4EEC;&#x5728;&#x8C08;&#x5230;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x65F6;&#xFF0C;&#x603B;&#x4F1A;&#x628A;&#x5B83;&#x548C;&#x7A0B;&#x5E8F;&#x7684;&#x9519;&#x8BEF;&#x8054;&#x7CFB;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x8F6F;&#x4EF6;&#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x5404;&#x79CD;&#x5F02;&#x5E38;&#x73B0;&#x8C61;&#xFF0C;&#x4F8B;&#x5982;&#x8F6F;&#x4EF6;&#x4EA7;&#x751F;&#x4E86;&#x9519;&#x8BEF;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#xFF0C;&#x7F51;&#x7AD9;&#x6162;&#x5F97;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x663E;&#x7136;&#x662F;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x800C;&#x8A00;&#xFF0C;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x5728;&#x6D4B;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6210;&#x4E3A;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x5173;&#x6CE8;&#x7684;&#x91CD;&#x70B9;&#xFF0C;&#x4E5F;&#x4F1A;&#x88AB;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x53D1;&#x73B0;&#x5E76;&#x4E14;&#x5F97;&#x5230;&#x53CA;&#x65F6;&#x4FEE;&#x6539;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x5E76;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8FD9;&#x4E9B;&#x660E;&#x663E;&#x7684;&#x7A0B;&#x5E8F;&#x9519;&#x8BEF;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x6240;&#x6709;&#x672A;&#x80FD;&#x6EE1;&#x8DB3;&#x76EE;&#x6807;&#x7FA4;&#x4F53;&#xFF08;&#x5373;&#x7528;&#x6237;&#xFF09;&#x9700;&#x6C42;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x90FD;&#x9700;&#x8981;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x6EE1;&#x8DB3;&#x7528;&#x6237;&#x7684;&#x4F7F;&#x7528;&#x9700;&#x6C42;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x662F;&#x4EFB;&#x4F55;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x90FD;&#x5F88;&#x96BE;&#x767E;&#x5206;&#x4E4B;&#x767E;&#x5730;&#x6EE1;&#x8DB3;&#x7528;&#x6237;&#x7684;&#x5B9E;&#x9645;&#x9700;&#x6C42;&#xFF0C;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x5730;&#x4F18;&#x5316;&#x548C;&#x6539;&#x8FDB;&#x800C;&#x6301;&#x7EED;&#x63A5;&#x8FD1;&#x7528;&#x6237;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<p>&#x2003;&#x2003;&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x7684;&#x63CF;&#x8FF0;&#x53EF;&#x4EE5;&#x5F97;&#x77E5;&#xFF0C;&#x5728;&#x8F6F;&#x4EF6;&#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x6240;&#x51FA;&#x73B0;&#x7684;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#xFF0C;&#x6216;&#x8005;&#x5BFC;&#x81F4;&#x8F6F;&#x4EF6;&#x4E0D;&#x80FD;&#x7B26;&#x5408;&#x8BBE;&#x8BA1;&#x8981;&#x6C42;&#x6216;&#x6EE1;&#x8DB3;&#x7528;&#x6237;&#x9700;&#x6C42;&#x7684;&#x95EE;&#x9898;&#x90FD;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#xFF0C;&#x6216;&#x79F0;&#x4E3A;Bug&#x3002;</p>
<p>&#x2003;&#x2003;&#x6B63;&#x786E;&#x7406;&#x89E3;&#x4E86;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x5730;&#x786E;&#x5B9A;&#x81EA;&#x5DF1;&#x53D1;&#x73B0;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x4E0D;&#x662F;&#x7F3A;&#x9677;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x7528;&#x6237;&#x7684;&#x9700;&#x6C42;&#x662F;&#x5224;&#x65AD;&#x7F3A;&#x9677;&#x7684;&#x5173;&#x952E;&#x3002;&#x56E0;&#x6B64;&#x5728;&#x786E;&#x5B9A;&#x7F3A;&#x9677;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x53EF;&#x4EE5;&#x4ECE;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x5165;&#x624B;&#x3002;</p>
<p>&#x2003;&#x2003;&#x9996;&#x5148;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8F6F;&#x4EF6;&#x9700;&#x6C42;&#x89C4;&#x683C;&#x8BF4;&#x660E;&#x4E66;&#x3001;&#x7528;&#x6237;&#x624B;&#x518C;&#x53CA;&#x8054;&#x673A;&#x5E2E;&#x52A9;&#x4F5C;&#x4E3A;&#x786E;&#x5B9A;&#x7F3A;&#x9677;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x5177;&#xFF0C;&#x8FD9;&#x4E9B;&#x6587;&#x6863;&#x8F83;&#x4E3A;&#x51C6;&#x786E;&#x5730;&#x53CD;&#x6620;&#x4E86;&#x7528;&#x6237;&#x9700;&#x6C42;&#xFF0C;&#x6240;&#x4EE5;&#x88AB;&#x5927;&#x591A;&#x6570;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x5728;&#x5B9E;&#x9645;&#x6D4B;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E2D;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5176;&#x6B21;&#xFF0C;&#x901A;&#x8FC7;&#x589E;&#x52A0;&#x81EA;&#x5DF1;&#x5BF9;&#x6240;&#x6D4B;&#x8BD5;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x7684;&#x884C;&#x4E1A;&#x80CC;&#x666F;&#x77E5;&#x8BC6;&#x7684;&#x4E86;&#x89E3;&#x6765;&#x53D1;&#x73B0;&#x88AB;&#x5FFD;&#x89C6;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4E2D;&#x5F80;&#x5F80;&#x9690;&#x85CF;&#x7740;&#x8F6F;&#x4EF6;&#x7684;&#x81F4;&#x547D;&#x7F3A;&#x9677;&#xFF0C;&#x800C;&#x4E14;&#x4F5C;&#x4E3A;&#x7528;&#x6237;&#x65B9;&#x5F80;&#x5F80;&#x4F1A;&#x8BA4;&#x4E3A;&#x77E5;&#x9053;&#x8FD9;&#x4E9B;&#x662F;&#x5E94;&#x8BE5;&#x7684;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x660E;&#x786E;&#x5199;&#x5728;&#x9700;&#x6C42;&#x91CC;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6700;&#x540E;&#xFF0C;&#x901A;&#x8FC7;&#x6C9F;&#x901A;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x786E;&#x5B9A;&#x53D1;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x662F;&#x5426;&#x662F;&#x7F3A;&#x9677;&#x3002;&#x4E3B;&#x8981;&#x662F;&#x548C;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#x6C9F;&#x901A;&#xFF0C;&#x548C;&#x6D4B;&#x8BD5;&#x8D1F;&#x8D23;&#x4EBA;&#x6C9F;&#x901A;&#xFF0C;&#x5F53;&#x5206;&#x6B67;&#x5F88;&#x5927;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x4EA4;&#x7ED9;&#x9879;&#x76EE;&#x8D1F;&#x8D23;&#x4EBA;&#x786E;&#x8BA4;&#x6216;&#x8005;&#x901A;&#x8FC7;&#x5C0F;&#x578B;&#x4F1A;&#x8BAE;&#x7684;&#x5F62;&#x5F0F;&#x8BA8;&#x8BBA;&#x786E;&#x8BA4;&#x3002;</p>
<h4 id="2&#xFF0E;&#x6709;&#x6548;&#x8BB0;&#x5F55;&#x7F3A;&#x9677;">2&#xFF0E;&#x6709;&#x6548;&#x8BB0;&#x5F55;&#x7F3A;&#x9677;</h4>
<p>&#x2003;&#x2003;&#x5F53;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x7F3A;&#x9677;&#x4EE5;&#x540E;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x8BB0;&#x5F55;&#x8FD9;&#x4E2A;&#x7F3A;&#x9677;&#xFF0C;&#x5E76;&#x63D0;&#x4EA4;&#x7ED9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x3002;&#x4E0B;&#x9762;&#x4E3E;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x8BB0;&#x5F55;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x7684;&#x6848;&#x4F8B;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7F3A;&#x9677;&#x63CF;&#x8FF0;&#xFF1A;&#x8BB0;&#x4E8B;&#x672C;&#x4E2D;&#x4FDD;&#x5B58;&#x201C;&#x8054;&#x901A;&#x201D;&#xFF0C;&#x518D;&#x6B21;&#x6253;&#x5F00;&#x540E;&#x51FA;&#x73B0;&#x4E71;&#x7801;&#xFF01;</p>
<p>&#x2003;&#x2003;&#x7F3A;&#x9677;&#x6B65;&#x9AA4;&#xFF1A;</p>
<p>&#x2003;&#x2003;&#xFF08;1&#xFF09;&#x6253;&#x5F00;&#x8BB0;&#x4E8B;&#x672C;&#xFF0C;&#x8F93;&#x5165;&#x201C;&#x8054;&#x901A;&#x201D;&#xFF08;&#x4E0D;&#x5E26;&#x5F15;&#x53F7;&#xFF09;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;2&#xFF09;&#x4FDD;&#x5B58;&#x8BE5;&#x6587;&#x4EF6;&#x5230;&#x4EFB;&#x610F;&#x4F4D;&#x7F6E;&#xFF0C;&#x6587;&#x4EF6;&#x540D;&#x4EFB;&#x610F;&#x8BBE;&#x7F6E;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;3&#xFF09;&#x518D;&#x6B21;&#x6253;&#x5F00;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x663E;&#x793A;&#x4E71;&#x7801;&#xFF0C;&#x5982;&#x56FE;10.3&#x6240;&#x793A;&#x3002;</p>
<p align="center"><img src="../img/d10z/tu10.3.png"></p>  
<p align="center">&#x56FE;10.3  &#x7F3A;&#x9677;&#x62A5;&#x544A;</p>  



<p>&#x2003;&#x2003;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x662F;&#x5927;&#x591A;&#x6570;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x7ED3;&#x679C;&#x4E4B;&#x4E00;&#x3002;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x7684;&#x8BFB;&#x8005;&#x5728;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x6587;&#x6863;&#x91CD;&#x73B0;&#x7F3A;&#x9677;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x901A;&#x8FC7;&#x6587;&#x6863;&#x4E86;&#x89E3;&#x4E86;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;&#x62A5;&#x544A;&#x5199;&#x5F97;&#x8D8A;&#x597D;&#xFF0C;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x58F0;&#x8A89;&#x8D8A;&#x9AD8;&#xFF0C;&#x4EE5;&#x540E;&#x7684;&#x5DE5;&#x4F5C;&#x4EA4;&#x6D41;&#x5C31;&#x4F1A;&#x66F4;&#x5BB9;&#x6613;&#x3002;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x901A;&#x8FC7;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x62A5;&#x544A;&#x5F97;&#x77E5;&#x7F3A;&#x9677;&#x4FE1;&#x606F;&#xFF0C;&#x5BF9;&#x91CD;&#x8981;&#x95EE;&#x9898;&#x7684;&#x51C6;&#x786E;&#x62A5;&#x544A;&#x4F1A;&#x4E3A;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x5E26;&#x6765;&#x826F;&#x597D;&#x58F0;&#x8A89;&#xFF0C;&#x5DEE;&#x7684;&#x62A5;&#x544A;&#x4F1A;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5E26;&#x6765;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x6D6A;&#x8D39;&#x4E86;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x592A;&#x591A;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C31;&#x4F1A;&#x5BF9;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x5DE5;&#x4F5C;&#x62B1;&#x6709;&#x6028;&#x8A00;&#x3002;&#x56E0;&#x6B64;&#x4E3A;&#x7F16;&#x5199;&#x51FA;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#xFF0C;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x9700;&#x8981;&#x7262;&#x8BB0;&#x4EE5;&#x4E0B;&#x4E66;&#x5199;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x7684;&#x51C6;&#x5219;&#x3002;</p>
<ul>
<li>&#x4FDD;&#x8BC1;&#x91CD;&#x73B0;&#x7F3A;&#x9677;</li>
</ul>
<p>&#x2003;&#x2003;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x80FD;&#x591F;&#x53CA;&#x65F6;&#x51C6;&#x786E;&#x5730;&#x4E86;&#x89E3;&#x8F6F;&#x4EF6;&#x5B58;&#x5728;&#x7684;&#x7F3A;&#x9677;&#xFF0C;&#x5B83;&#x662F;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x4E0E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6C9F;&#x901A;&#x7684;&#x91CD;&#x8981;&#x624B;&#x6BB5;&#x3002;&#x56E0;&#x6B64;&#x5FC5;&#x987B;&#x4FDD;&#x8BC1;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x80FD;&#x591F;&#x6E05;&#x6670;&#x63CF;&#x8FF0;&#x7F3A;&#x9677;&#xFF0C;&#x4FDD;&#x8BC1;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x63CF;&#x8FF0;&#x6B65;&#x9AA4;&#x7684;&#x5F15;&#x5BFC;&#x767E;&#x5206;&#x4E4B;&#x767E;&#x5730;&#x91CD;&#x73B0;&#x7F3A;&#x9677;&#x3002;</p>
<ul>
<li>&#x4F7F;&#x7528;&#x6700;&#x5C11;&#x6B65;&#x9AA4;&#x8BB0;&#x5F55;&#x7F3A;&#x9677;</li>
</ul>
<p>&#x2003;&#x2003;&#x867D;&#x7136;&#x8BF4;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x53EA;&#x9700;&#x8981;&#x53D1;&#x73B0;&#x7F3A;&#x9677;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4FEE;&#x590D;&#x7F3A;&#x9677;&#xFF0C;&#x4F46;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4F18;&#x79C0;&#x7684;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x5E94;&#x8BE5;&#x4F1A;&#x5206;&#x6790;&#x95EE;&#x9898;&#xFF0C;&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x6700;&#x5C11;&#x7684;&#x6B65;&#x9AA4;&#x8BB0;&#x5F55;&#x7F3A;&#x9677;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7528;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#x7684;&#x6B65;&#x9AA4;&#x63CF;&#x8FF0;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x4F1A;&#x964D;&#x4F4E;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x88AB;&#x4FEE;&#x590D;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x590D;&#x6742;&#x7684;&#x6B65;&#x9AA4;&#x548C;&#x5927;&#x91CF;&#x7684;&#x6587;&#x5B57;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x63D0;&#x70BC;&#x51FA;&#x51FA;&#x73B0;&#x7F3A;&#x9677;&#x7684;&#x5173;&#x952E;&#xFF0C;&#x5374;&#x5360;&#x7528;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5F88;&#x591A;&#x5B9D;&#x8D35;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4E45;&#x800C;&#x4E45;&#x4E4B;&#x4F1A;&#x5F15;&#x8D77;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x53CD;&#x611F;&#xFF0C;&#x4ECE;&#x800C;&#x964D;&#x4F4E;&#x63D0;&#x4EA4;&#x8FD9;&#x7C7B;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x4EBA;&#x5458;&#x7684;&#x53D7;&#x4FE1;&#x5EA6;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x8BB0;&#x5F55;&#x7F3A;&#x9677;&#x7684;&#x8FC7;&#x7A0B;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#xFF0C;&#x5219;&#x4F1A;&#x7ED9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x91CD;&#x73B0;&#x7F3A;&#x9677;&#x7684;&#x8FC7;&#x7A0B;&#x5E26;&#x6765;&#x5F88;&#x5927;&#x7684;&#x56F0;&#x96BE;&#xFF0C;&#x800C;&#x4E14;&#x4E5F;&#x4F1A;&#x8BA9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x80FD;&#x5C06;&#x95EE;&#x9898;&#x96C6;&#x4E2D;&#x5728;&#x4E3B;&#x8981;&#x7684;&#x6B65;&#x9AA4;&#x4E0A;&#x3002;</p>
<ul>
<li>&#x5305;&#x542B;&#x91CD;&#x73B0;&#x7F3A;&#x9677;&#x7684;&#x5FC5;&#x8981;&#x6B65;&#x9AA4;</li>
</ul>
<p>&#x2003;&#x2003;&#x4E4B;&#x6240;&#x4EE5;&#x8981;&#x6C42;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x5FC5;&#x987B;&#x5305;&#x542B;&#x6240;&#x6709;&#x91CD;&#x73B0;&#x7F3A;&#x9677;&#x7684;&#x5FC5;&#x8981;&#x6B65;&#x9AA4;&#xFF0C;&#x662F;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x7684;&#x6613;&#x7528;&#x6027;&#x3002;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x548C;&#x6D4B;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x5BF9;&#x8F6F;&#x4EF6;&#x5404;&#x79CD;&#x529F;&#x80FD;&#x662F;&#x6700;&#x719F;&#x6089;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x7F16;&#x5199;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E00;&#x4E9B;&#x5E38;&#x7528;&#x7684;&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x8BA4;&#x4E3A;&#x662F;&#x60F3;&#x5F53;&#x7136;&#x7684;&#x800C;&#x5FFD;&#x89C6;&#x8BB0;&#x5F55;&#xFF0C;&#x4ECE;&#x800C;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x91CD;&#x73B0;&#x7F3A;&#x9677;&#x57CB;&#x4E0B;&#x9690;&#x60A3;&#x3002;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x8FD9;&#x4E9B;&#x5728;&#x62A5;&#x544A;&#x4E2D;&#x88AB;&#x5FFD;&#x89C6;&#x7684;&#x6B65;&#x9AA4;&#x53EF;&#x80FD;&#x7ED9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x91CD;&#x73B0;&#x7F3A;&#x9677;&#x5E26;&#x6765;&#x56F0;&#x96BE;&#xFF1B;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5F53;&#x8FD9;&#x7C7B;&#x62A5;&#x544A;&#x7ECF;&#x8FC7;&#x957F;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#x518D;&#x88AB;&#x6253;&#x5F00;&#xFF0C;&#x53EF;&#x80FD;&#x8FDE;&#x63D0;&#x4EA4;&#x8005;&#x81EA;&#x5DF1;&#x4E5F;&#x65E0;&#x6CD5;&#x7ACB;&#x523B;&#x4F9D;&#x636E;&#x62A5;&#x544A;&#x91CD;&#x73B0;&#x7F3A;&#x9677;&#x7684;&#x4EA7;&#x751F;&#x8FC7;&#x7A0B;&#x3002;</p>
<ul>
<li>&#x5BA2;&#x89C2;&#x3001;&#x65B9;&#x4FBF;&#x9605;&#x8BFB;</li>
</ul>
<p>&#x2003;&#x2003;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x662F;&#x63CF;&#x8FF0;&#x6027;&#x77ED;&#x6587;&#xFF0C;&#x5728;&#x7F16;&#x5199;&#x65F6;&#x8981;&#x6CE8;&#x610F;&#x5BA2;&#x89C2;&#x3001;&#x65B9;&#x4FBF;&#x9605;&#x8BFB;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E00;&#x662F;&#x62A5;&#x544A;&#x7684;&#x6838;&#x5FC3;&#x90E8;&#x5206;&#x662F;&#x91CD;&#x73B0;&#x7F3A;&#x9677;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x5F53;&#x5206;&#x6B65;&#x9AA4;&#x63CF;&#x8FF0;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8981;&#x5BF9;&#x64CD;&#x4F5C;&#x8FC7;&#x7A0B;&#x8FDB;&#x884C;&#x7F16;&#x53F7;&#xFF0C;&#x5728;&#x4E66;&#x5199;&#x683C;&#x5F0F;&#x4E0A;&#x8981;&#x6C42;&#x6BCF;&#x4E2A;&#x6B65;&#x9AA4;&#x72EC;&#x5360;&#x4E00;&#x884C;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E8C;&#x662F;&#x5728;&#x62A5;&#x544A;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x65F6;&#x4E0D;&#x505A;&#x8BC4;&#x4EF7;&#xFF0C;&#x65E2;&#x7136;&#x662F;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x9488;&#x5BF9;&#x7684;&#x662F;&#x4EA7;&#x54C1;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x4E2D;&#xFF0C;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x65E2;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x5BF9;&#x7F3A;&#x9677;&#x672C;&#x8EAB;&#x7684;&#x6210;&#x56E0;&#x8FDB;&#x884C;&#x6CA1;&#x6709;&#x6839;&#x636E;&#x7684;&#x731C;&#x6D4B;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x5BF9;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x6C34;&#x5E73;&#x5728;&#x62A5;&#x544A;&#x4E2D;&#x8FDB;&#x884C;&#x8BC4;&#x4EF7;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E09;&#x662F;&#x62A5;&#x544A;&#x7684;&#x6807;&#x9898;&#x90E8;&#x5206;&#x8981;&#x7B80;&#x6D01;&#x660E;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x7A81;&#x51FA;&#x62A5;&#x544A;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x3002;&#x6807;&#x9898;&#x662F;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x662F;&#x4EBA;&#x4EEC;&#x8BA4;&#x77E5;&#x6240;&#x62A5;&#x7F3A;&#x9677;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x3002;&#x8FC7;&#x4E8E;&#x7B80;&#x5355;&#x7684;&#x6807;&#x9898;&#x4F1A;&#x5F71;&#x54CD;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x524D;&#x671F;&#x7B5B;&#x9009;&#x62A5;&#x544A;&#x7684;&#x51C6;&#x786E;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E00;&#x822C;&#x4F1A;&#x82B1;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x5728;&#x90A3;&#x4E9B;&#x6807;&#x9898;&#x4E2D;&#x5E26;&#x6709;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#x7684;&#x7F3A;&#x9677;&#x4E0A;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6807;&#x9898;&#x901A;&#x5E38;&#x5E94;&#x8BE5;&#x5305;&#x62EC;&#xFF1A;&#x7B80;&#x8981;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x80FD;&#x591F;&#x8BA9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x60F3;&#x8C61;&#x51FA;&#x7F3A;&#x9677;&#x7684;&#x6B65;&#x9AA4;&#xFF1B;&#x7B80;&#x8981;&#x6307;&#x51FA;&#x7A0B;&#x5E8F;&#x51FA;&#x9519;&#x7684;&#x7279;&#x5B9A;&#x6761;&#x4EF6;&#xFF0C;&#x5982;&#x5728;&#x54EA;&#x4E2A;&#x5E73;&#x53F0;&#x4E0B;&#x51FA;&#x73B0;&#x7B49;&#xFF1B;&#x7B80;&#x8981;&#x6307;&#x51FA;&#x7A0B;&#x5E8F;&#x9519;&#x8BEF;&#x7684;&#x5F71;&#x54CD;&#x6216;&#x540E;&#x679C;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x628A;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x90FD;&#x653E;&#x5165;&#x6807;&#x9898;&#x90E8;&#x5206;&#xFF0C;&#x4EC5;&#x9700;&#x8981;&#x5728;&#x6807;&#x9898;&#x4E2D;&#x8BF4;&#x660E;&#x5BF9;&#x4E8E;&#x62A5;&#x544A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x5185;&#x5BB9;&#x53EF;&#x4EE5;&#x653E;&#x5230;&#x62A5;&#x544A;&#x7684;&#x63CF;&#x8FF0;&#x90E8;&#x5206;&#x8FDB;&#x884C;&#x8BF4;&#x660E;&#x3002;</p>
<p>&#x2003;&#x2003;&#x56DB;&#x662F;&#x5728;&#x62A5;&#x544A;&#x7684;&#x8BE6;&#x7EC6;&#x5185;&#x5BB9;&#x90E8;&#x5206;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x8BED;&#x8A00;&#x4E0D;&#x6613;&#x8BF4;&#x6E05;&#x695A;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD0;&#x7528;&#x622A;&#x56FE;&#x6216;&#x4FDD;&#x5B58;&#x9519;&#x8BEF;&#x6587;&#x4EF6;&#x7B49;&#x8F85;&#x52A9;&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x95EE;&#x9898;&#x63CF;&#x8FF0;&#x5F97;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#x3002;</p>
<ul>
<li>&#x4E00;&#x4E2A;&#x7F3A;&#x9677;&#x4E00;&#x4E2A;&#x62A5;&#x544A;</li>
</ul>
<p>&#x2003;&#x2003;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x5E94;&#x5C3D;&#x53EF;&#x80FD;&#x7B80;&#x5355;&#xFF0C;&#x4E0D;&#x8981;&#x5728;&#x4E00;&#x4E2A;&#x62A5;&#x544A;&#x4E2D;&#x5408;&#x5E76;&#x591A;&#x4E2A;&#x7F3A;&#x9677;&#x3002;&#x5F53;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x4E2D;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x7F3A;&#x9677;&#x65F6;&#xFF0C;&#x901A;&#x5E38;&#x53EA;&#x6709;&#x7B2C;&#x4E00;&#x4E2A;&#x7F3A;&#x9677;&#x4F1A;&#x53D7;&#x5230;&#x6CE8;&#x610F;&#x548C;&#x4FEE;&#x590D;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x5219;&#x4F1A;&#x88AB;&#x9057;&#x5FD8;&#x6216;&#x5FFD;&#x89C6;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x4E2D;&#x6709;&#x591A;&#x4E2A;&#x7F3A;&#x9677;&#xFF0C;&#x4F46;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x5F53;&#x65F6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EA;&#x80FD;&#x4FEE;&#x590D;&#x8FD9;&#x4E9B;&#x7F3A;&#x9677;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x800C;&#x4E0D;&#x662F;&#x5168;&#x90E8;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x5C31;&#x65E0;&#x6CD5;&#x5BF9;&#x6BCF;&#x4E2A;&#x7F3A;&#x9677;&#x8FDB;&#x884C;&#x72EC;&#x7ACB;&#x7684;&#x8DDF;&#x8E2A;&#x3002;</p>
<ul>
<li>&#x62A5;&#x544A;&#x4E0D;&#x53EF;&#x91CD;&#x73B0;&#x7684;&#x7F3A;&#x9677;</li>
</ul>
<p>&#x2003;&#x2003;&#x6C38;&#x8FDC;&#x90FD;&#x8981;&#x62A5;&#x544A;&#x4E0D;&#x53EF;&#x91CD;&#x73B0;&#x7684;&#x7F3A;&#x9677;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x7F3A;&#x9677;&#x5BF9;&#x516C;&#x53F8;&#x4EA7;&#x54C1;&#x7684;&#x5F71;&#x54CD;&#x5F80;&#x5F80;&#x662F;&#x81F4;&#x547D;&#x7684;&#x3002;&#x6709;&#x65F6;&#x7F3A;&#x9677;&#x8868;&#x73B0;&#x51FA;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x91CD;&#x73B0;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5373;&#x770B;&#x5230;&#x7A0B;&#x5E8F;&#x51FA;&#x9519;&#x4E00;&#x6B21;&#xFF0C;&#x4F46;&#x4E0D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x4F7F;&#x5176;&#x518D;&#x6B21;&#x51FA;&#x73B0;&#x3002;&#x4F46;&#x5982;&#x679C;&#x4EA7;&#x54C1;&#x4EA4;&#x4ED8;&#x5BA2;&#x6237;&#x540E;&#x8FD8;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4F1A;&#x5F71;&#x54CD;&#x5BA2;&#x6237;&#x5BF9;&#x4EA7;&#x54C1;&#x7684;&#x4FE1;&#x5FC3;&#x3002;&#x6240;&#x4EE5;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x4E00;&#x65E6;&#x53D1;&#x73B0;&#x8FD9;&#x79CD;&#x4E0D;&#x53EF;&#x91CD;&#x73B0;&#x7684;&#x7F3A;&#x9677;&#xFF0C;&#x9700;&#x8981;&#x53CA;&#x65F6;&#x62A5;&#x544A;&#xFF0C;&#x5F53;&#x7C7B;&#x4F3C;&#x7684;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x591A;&#x4E86;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5E38;&#x5E38;&#x5C31;&#x80FD;&#x603B;&#x7ED3;&#x51FA;&#x7F3A;&#x9677;&#x51FA;&#x73B0;&#x7684;&#x89C4;&#x5F8B;&#xFF0C;&#x53D1;&#x73B0;&#x4EA7;&#x751F;&#x7F3A;&#x9677;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<h3 id="1043--&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x5904;&#x7406;">10.4.3  &#x7F3A;&#x9677;&#x62A5;&#x544A;&#x5904;&#x7406;</h3>
<p>&#x2003;&#x2003;&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x5B66;&#x4E60;&#x4E86;&#x600E;&#x6837;&#x7F16;&#x5199;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#xFF0C;&#x90A3;&#x4E48;&#x7F16;&#x5199;&#x5B8C;&#x4E00;&#x4E2A;&#x5408;&#x683C;&#x7684;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x4E4B;&#x540E;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#x662F;&#x600E;&#x6837;&#x7684;&#x5462;&#xFF1F;</p>
<h4 id="1&#xFF0E;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x5904;&#x7406;&#x6D41;&#x7A0B;">1&#xFF0E;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x5904;&#x7406;&#x6D41;&#x7A0B;</h4>
<p>&#x2003;&#x2003;&#x4E00;&#x4E2A;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x7684;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#x5982;&#x56FE;10.4&#x6240;&#x793A;&#x3002;</p>
<p align="center"><img src="../img/d10z/tu10.4.png"></p>  
<p align="center">&#x56FE;10.4  &#x7F3A;&#x9677;&#x62A5;&#x544A;&#x5904;&#x7406;&#x6D41;&#x7A0B;</p>  



<p>&#x2003;&#x2003;&#x4ECE;&#x56FE;10.4&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5BF9;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x7684;&#x5904;&#x7406;&#x8981;&#x7ECF;&#x8FC7;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x63D0;&#x4EA4;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#xFF0C;&#x6D4B;&#x8BD5;&#x8D1F;&#x8D23;&#x4EBA;&#xFF08;&#x6216;&#x5F00;&#x53D1;&#x8D1F;&#x8D23;&#x4EBA;&#xFF09;&#x5BA1;&#x6838;&#x540E;&#x5C06;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x5206;&#x914D;&#x7ED9;&#x76F8;&#x5173;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4FEE;&#x6539;&#xFF0C;&#x7F3A;&#x9677;&#x88AB;&#x4FEE;&#x6539;&#x540E;&#x7531;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x6839;&#x636E;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x4E2D;&#x7684;&#x4FEE;&#x6539;&#x8BB0;&#x5F55;&#x8FDB;&#x884C;&#x8FD4;&#x6D4B;&#xFF0C;&#x8FD4;&#x6D4B;&#x901A;&#x8FC7;&#x7684;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x7531;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x6216;&#x6D4B;&#x8BD5;&#x8D1F;&#x8D23;&#x4EBA;&#x5173;&#x95ED;&#xFF0C;&#x8FD4;&#x6D4B;&#x672A;&#x901A;&#x8FC7;&#x7684;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x91CD;&#x65B0;&#x4FEE;&#x6539;&#xFF0C;&#x76F4;&#x5230;&#x7F3A;&#x9677;&#x88AB;&#x4FEE;&#x590D;&#x4EE5;&#x540E;&#x624D;&#x5173;&#x95ED;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x7684;&#x5904;&#x7406;&#x53EA;&#x7ECF;&#x8FC7;&#x63D0;&#x4EA4;&#x3001;&#x5206;&#x914D;&#x3001;&#x89E3;&#x51B3;&#x3001;&#x8FD4;&#x6D4B;&#x3001;&#x5173;&#x95ED;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x8FDE;&#x5206;&#x914D;&#x7684;&#x8FC7;&#x7A0B;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#xFF0C;&#x76F4;&#x63A5;&#x7531;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x63D0;&#x4EA4;&#x7ED9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8FDB;&#x884C;&#x89E3;&#x51B3;&#xFF0C;&#x4E4B;&#x540E;&#x8FD4;&#x6D4B;&#x3001;&#x5173;&#x95ED;&#x3002;&#x4F46;&#x662F;&#x5728;&#x4E00;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4F1A;&#x53D8;&#x5F97;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6253;&#x5F00;&#x63D0;&#x4EA4;&#x7684;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x540E;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x5BF9;&#x62A5;&#x544A;&#x4E2D;&#x7684;&#x7F3A;&#x9677;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x56E0;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x80FD;&#x8BA4;&#x4E3A;&#x6B64;&#x95EE;&#x9898;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7F3A;&#x9677;&#x6216;&#x8005;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x7F3A;&#x9677;&#x53EF;&#x4EE5;&#x5728;&#x4EE5;&#x540E;&#x7684;&#x7248;&#x672C;&#x4E2D;&#x89E3;&#x51B3;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x5904;&#x7406;&#x610F;&#x89C1;&#x4E2D;&#x4F1A;&#x586B;&#x5165;&#x201C;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#x201D;&#x6216;&#x201C;&#x4EE5;&#x540E;&#x7248;&#x672C;&#x89E3;&#x51B3;&#x201D;&#x3002;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x5728;&#x770B;&#x5230;&#x8FD9;&#x4E00;&#x5904;&#x7406;&#x610F;&#x89C1;&#x540E;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x4E0D;&#x540C;&#x610F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x5E76;&#x5C06;&#x6709;&#x8BF4;&#x670D;&#x529B;&#x7684;&#x7406;&#x7531;&#x586B;&#x5199;&#x5728;&#x62A5;&#x544A;&#x4E2D;&#xFF0C;&#x5E76;&#x5C06;&#x8FD9;&#x4E00;&#x62A5;&#x544A;&#x518D;&#x6B21;&#x63D0;&#x4EA4;&#x7ED9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x3002;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x770B;&#x5230;&#x6B64;&#x610F;&#x89C1;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x540C;&#x610F;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x5C31;&#x4F1A;&#x4FEE;&#x590D;&#x8FD9;&#x4E00;&#x7F3A;&#x9677;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5982;&#x679C;&#x4E0D;&#x540C;&#x610F;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x610F;&#x89C1;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x4EEC;&#x4F1A;&#x518D;&#x6B21;&#x8C03;&#x6574;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x7684;&#x5904;&#x7406;&#x610F;&#x89C1;&#x3002;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x5173;&#x4E8E;&#x7F3A;&#x9677;&#x662F;&#x5426;&#x4FEE;&#x6539;&#x7684;&#x8BA8;&#x8BBA;&#x8FC7;&#x7A0B;&#x6709;&#x65F6;&#x4F1A;&#x5F80;&#x590D;&#x591A;&#x6B21;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x5927;&#x5BB6;&#x90FD;&#x80FD;&#x8BA4;&#x53EF;&#x7684;&#x7ED3;&#x8BBA;&#x6216;&#x8005;&#x7531;&#x9879;&#x76EE;&#x8D1F;&#x8D23;&#x4EBA;&#x51B3;&#x5B9A;&#x3002;</p>
<h4 id="2&#xFF0E;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x8BE6;&#x7EC6;&#x5185;&#x5BB9;">2&#xFF0E;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x8BE6;&#x7EC6;&#x5185;&#x5BB9;</h4>
<p>&#x2003;&#x2003;&#x5728;10.4.2&#x8282;&#x7684;&#x5185;&#x5BB9;&#x4E2D;&#xFF0C;&#x5B66;&#x4E60;&#x4E86;&#x4E3A;&#x4E86;&#x4FC3;&#x8FDB;&#x6C9F;&#x901A;&#x5982;&#x4F55;&#x6709;&#x6548;&#x8BB0;&#x5F55;&#x7F3A;&#x9677;&#x3002;&#x5F53;&#x65F6;&#x63D0;&#x4F9B;&#x7684;&#x4E00;&#x4E2A;&#x6848;&#x4F8B;&#x53EF;&#x4EE5;&#x8D77;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x8BB0;&#x5F55;&#x7F3A;&#x9677;&#xFF0C;&#x4F7F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x80FD;&#x591F;&#x91CD;&#x73B0;&#x8FD9;&#x4E2A;&#x7F3A;&#x9677;&#x3002;&#x901A;&#x8FC7;&#x672C;&#x8282;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x53D1;&#x73B0;&#x4EC5;&#x4EC5;&#x8BB0;&#x5F55;&#x7F3A;&#x9677;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x8DDF;&#x8E2A;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x5904;&#x7406;&#x7684;&#x5168;&#x8FC7;&#x7A0B;&#xFF0C;&#x6700;&#x7EC8;&#x76EE;&#x7684;&#x662F;&#x4FEE;&#x590D;&#x7F3A;&#x9677;&#x6216;&#x8005;&#x8BA9;&#x7F3A;&#x9677;&#x6709;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x63A5;&#x6536;&#x7684;&#x5904;&#x7406;&#x529E;&#x6CD5;&#x3002;&#x7EFC;&#x5408;&#x8FD9;&#x4E9B;&#x8981;&#x6C42;&#xFF0C;&#x5E76;&#x5728;&#x4E4B;&#x524D;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x4E00;&#x4E9B;&#x5185;&#x5BB9;&#xFF0C;&#x73B0;&#x5C06;&#x4E00;&#x4E2A;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x7684;&#x5185;&#x5BB9;&#x9010;&#x4E2A;&#x4ECB;&#x7ECD;&#x7ED9;&#x5927;&#x5BB6;&#x3002;</p>
<ul>
<li><p>&#x7F3A;&#x9677;&#x6807;&#x9898;&#xFF1A;&#x7B80;&#x8981;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x80FD;&#x591F;&#x8BA9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x60F3;&#x8C61;&#x51FA;&#x7F3A;&#x9677;&#xFF0C;&#x6307;&#x51FA;&#x7A0B;&#x5E8F;&#x9519;&#x8BEF;&#x7684;&#x7279;&#x5B9A;&#x6761;&#x4EF6;&#x548C;&#x7A0B;&#x5E8F;&#x9519;&#x8BEF;&#x7684;&#x5F71;&#x54CD;&#x6216;&#x540E;&#x679C;&#x3002;</p>
</li>
<li><p>&#x6240;&#x5C5E;&#x4EA7;&#x54C1;&#xFF1A;&#x8868;&#x793A;&#x8BE5;&#x7F3A;&#x9677;&#x6240;&#x5C5E;&#x7684;&#x4EA7;&#x54C1;&#x3002;</p>
</li>
<li><p>&#x4EA7;&#x54C1;&#x7248;&#x672C;&#xFF1A;&#x8868;&#x793A;&#x6D4B;&#x8BD5;&#x65F6;&#x8BE5;&#x7F3A;&#x9677;&#x6240;&#x5C5E;&#x7684;&#x4EA7;&#x54C1;&#x7248;&#x672C;&#x3002;</p>
</li>
<li><p>&#x6240;&#x5C5E;&#x6A21;&#x5757;&#xFF1A;&#x8868;&#x793A;&#x8BE5;&#x7F3A;&#x9677;&#x5728;&#x6240;&#x5C5E;&#x4EA7;&#x54C1;&#x4E2D;&#x7684;&#x6A21;&#x5757;&#x3002;</p>
</li>
<li><p>&#x6B64;&#x65F6;&#x72B6;&#x6001;&#xFF1A;&#x8868;&#x793A;&#x8BE5;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4F8B;&#x5982;&#x65B0;&#x63D0;&#x4EA4;&#x3001;&#x5F85;&#x89E3;&#x51B3;&#x3001;&#x5DF2;&#x89E3;&#x51B3;&#x3001;&#x5DF2;&#x5173;&#x95ED;&#x7B49;&#x3002;</p>
</li>
<li><p>&#x4F18;&#x5148;&#x7EA7;&#xFF1A;&#x8868;&#x793A;&#x4FEE;&#x590D;&#x7F3A;&#x9677;&#x7684;&#x91CD;&#x8981;&#x7A0B;&#x5EA6;&#x548C;&#x4F18;&#x5148;&#x7EA7;&#x522B;&#x3002;</p>
</li>
<li><p>&#x786C;&#x4EF6;&#x5E73;&#x53F0;&#xFF1A;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x7684;&#x786C;&#x4EF6;&#x5E73;&#x53F0;&#xFF0C;&#x4F8B;&#x5982;&#x9009;&#x62E9;PC&#x3002;</p>
</li>
<li><p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF1A;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x4F7F;&#x7528;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F8B;&#x5982;&#x9009;&#x62E9;Windows&#x3002;</p>
</li>
<li><p>&#x8DDF;&#x8E2A;&#x4FE1;&#x606F;&#xFF1A;&#x8BB0;&#x5F55;&#x8FD9;&#x4E2A;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x7ECF;&#x8FC7;&#x54EA;&#x4E9B;&#x4EBA;&#x505A;&#x4E86;&#x54EA;&#x4E9B;&#x5904;&#x7406;&#x3002;</p>
</li>
<li><p>&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x8005;&#xFF1A;&#x8868;&#x793A;&#x63D0;&#x4EA4;&#x8FD9;&#x4E2A;&#x7F3A;&#x9677;&#x7684;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x901A;&#x5E38;&#x6709;&#x90AE;&#x4EF6;&#x5730;&#x5740;&#x3002;</p>
</li>
<li><p>&#x7F3A;&#x9677;&#x5904;&#x7406;&#x8005;&#xFF1A;&#x8868;&#x793A;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x7F3A;&#x9677;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x901A;&#x5E38;&#x4E5F;&#x6709;&#x90AE;&#x4EF6;&#x5730;&#x5740;&#x3002;</p>
</li>
<li><p>&#x7F3A;&#x9677;&#x6284;&#x9001;&#x4EBA;&#xFF1A;&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x7F3A;&#x9677;&#x6284;&#x9001;&#x7684;&#x4EBA;&#x5458;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x6D4B;&#x8BD5;&#x3001;&#x5F00;&#x53D1;&#x8D1F;&#x8D23;&#x4EBA;&#x6216;&#x8005;&#x76F8;&#x5173;&#x6A21;&#x5757;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x3002;</p>
</li>
<li><p>&#x7F3A;&#x9677;&#x6B65;&#x9AA4;&#x63CF;&#x8FF0;&#xFF1A;&#x5BF9;&#x7F3A;&#x9677;&#x7684;&#x8BE6;&#x7EC6;&#x6B65;&#x9AA4;&#x63CF;&#x8FF0;&#xFF0C;&#x4FDD;&#x8BC1;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x80FD;&#x591F;&#x91CD;&#x73B0;&#x7F3A;&#x9677;&#x3002;</p>
</li>
<li><p>&#x9644;&#x4EF6;&#xFF1A;&#x8BE5;&#x7F3A;&#x9677;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x7684;&#x76F8;&#x5173;&#x9644;&#x4EF6;&#xFF0C;&#x4F8B;&#x5982;&#x56FE;&#x7247;&#x6216;&#x9519;&#x8BEF;&#x6587;&#x4EF6;&#x3002;</p>
</li>
</ul>
<h3 id="1044--&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x6D41;&#x7A0B;">10.4.4  &#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x6D41;&#x7A0B;</h3>
<p>&#x2003;&#x2003;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x4EE5;&#x7B80;&#x5355;&#x7684;&#x7011;&#x5E03;&#x6A21;&#x578B;&#x6765;&#x8BF4;&#xFF0C;&#x5305;&#x62EC;&#x9700;&#x6C42;&#x5206;&#x6790;&#x3001;&#x6982;&#x8981;&#x8BBE;&#x8BA1;&#x3001;&#x8BE6;&#x7EC6;&#x8BBE;&#x8BA1;&#x3001;&#x7F16;&#x7801;&#x3001;&#x6D4B;&#x8BD5;&#x548C;&#x8FD0;&#x884C;&#x7EF4;&#x62A4;&#xFF0C;&#x56FE;10.5&#x663E;&#x793A;&#x4E86;&#x8F6F;&#x4EF6;&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x7011;&#x5E03;&#x6A21;&#x578B;&#x3002;</p>
<h4 id="1&#xFF0E;&#x9700;&#x6C42;&#x5206;&#x6790;&#x9636;&#x6BB5;">1&#xFF0E;&#x9700;&#x6C42;&#x5206;&#x6790;&#x9636;&#x6BB5;</h4>
<p>&#x2003;&#x2003;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x7684;&#x524D;&#x671F;&#x5DE5;&#x4F5C;&#x4E3B;&#x8981;&#x662F;&#x9700;&#x6C42;&#x5206;&#x6790;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x6216;&#x4EA7;&#x54C1;&#x7684;&#x6210;&#x8D25;&#x4E0E;&#x9700;&#x6C42;&#x5206;&#x6790;&#x6709;&#x7740;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x8054;&#x7CFB;&#x3002;&#x56E0;&#x6B64;&#x5728;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x7528;&#x6237;&#x9700;&#x6C42;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x76F2;&#x76EE;&#x5730;&#x8FDB;&#x884C;&#x5F00;&#x53D1;&#x548C;&#x6D4B;&#x8BD5;&#x90FD;&#x4E0D;&#x80FD;&#x591F;&#x53D6;&#x5F97;&#x7406;&#x60F3;&#x7684;&#x6548;&#x679C;&#x3002;&#x82E5;&#x5177;&#x5907;&#x6761;&#x4EF6;&#xFF0C;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x5E94;&#x4ECE;&#x5BA2;&#x6237;&#x9700;&#x6C42;&#x8C03;&#x7814;&#x9636;&#x6BB5;&#x5C31;&#x4ECB;&#x5165;&#x5230;&#x9879;&#x76EE;&#x4E2D;&#x3002;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x9700;&#x6C42;&#x8C03;&#x7814;&#x9636;&#x6BB5;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x5982;&#x56FE;10.6&#x6240;&#x793A;&#x3002;</p>
<p align="center"><img src="../img/d10z/tu10.5.png"></p>  
<p align="center">&#x56FE;10.5  &#x8F6F;&#x4EF6;&#x751F;&#x547D;&#x5468;&#x671F;&#x7011;&#x5E03;&#x6A21;&#x578B;</p>  



<p>&#x2003;&#x2003;&#x5728;&#x8FD9;&#x4E00;&#x9636;&#x6BB5;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6295;&#x5165;&#x592A;&#x591A;&#x7684;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x8FDB;&#x5165;&#x5230;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x6311;&#x9009;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x7EC4;&#x957F;&#x8FDB;&#x5165;&#x9879;&#x76EE;&#xFF0C;&#x53C2;&#x4E0E;&#x5230;&#x9700;&#x6C42;&#x5206;&#x6790;&#x9636;&#x6BB5;&#x7684;&#x9700;&#x6C42;&#x8BC4;&#x5BA1;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x6700;&#x7EC8;&#x786E;&#x5B9A;&#x7684;&#x9700;&#x6C42;&#x89C4;&#x683C;&#x8BF4;&#x660E;&#x4E66;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x7684;&#x65B9;&#x6848;&#x3002;</p>
<h4 id="2&#xFF0E;&#x8BBE;&#x8BA1;&#x548C;&#x7F16;&#x7801;&#x9636;&#x6BB5;">2&#xFF0E;&#x8BBE;&#x8BA1;&#x548C;&#x7F16;&#x7801;&#x9636;&#x6BB5;</h4>
<p>&#x2003;&#x2003;&#x9700;&#x6C42;&#x5206;&#x6790;&#x7ED3;&#x675F;&#x4EE5;&#x540E;&#xFF0C;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x4F1A;&#x6839;&#x636E;&#x9700;&#x6C42;&#x89C4;&#x683C;&#x8BF4;&#x660E;&#x4E66;&#x7684;&#x8981;&#x6C42;&#x5F00;&#x59CB;&#x8BBE;&#x8BA1;&#x8F6F;&#x4EF6;&#x3002;&#x9996;&#x5148;&#x662F;&#x6982;&#x8981;&#x8BBE;&#x8BA1;&#xFF0C;&#x4E4B;&#x540E;&#x662F;&#x8BE6;&#x7EC6;&#x8BBE;&#x8BA1;&#xFF0C;&#x6700;&#x540E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6839;&#x636E;&#x4EA7;&#x54C1;&#x7684;&#x8BE6;&#x7EC6;&#x8BBE;&#x8BA1;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#x53EB;&#x505A;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x548C;&#x7F16;&#x7801;&#x9636;&#x6BB5;&#xFF0C;&#x5176;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x5982;&#x56FE;10.7&#x6240;&#x793A;&#x3002;</p>
<p align="center"><img src="../img/d10z/tu10.6.png"></p>  
<p align="center">&#x56FE;10.6  &#x8F6F;&#x4EF6;&#x9700;&#x6C42;&#x5206;&#x6790;&#x9636;&#x6BB5;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;  </p>  


<p align="center"><img src="../img/d10z/tu10.7.png"></p>  
<p align="center">&#x56FE;10.7  &#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x548C;&#x7F16;&#x7801;&#x9636;&#x6BB5;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B; </p>  

<p>&#x200B;                                     </p>
<p>&#x2003;&#x2003;&#x5728;&#x8FD9;&#x4E00;&#x9636;&#x6BB5;&#xFF0C;&#x6295;&#x5165;&#x7684;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x592A;&#x591A;&#xFF0C;&#x901A;&#x5E38;&#x8FD8;&#x662F;&#x4E4B;&#x524D;&#x8FDB;&#x5165;&#x9879;&#x76EE;&#x7EC4;&#x7684;&#x6D4B;&#x8BD5;&#x7EC4;&#x957F;&#x7EE7;&#x7EED;&#x8DDF;&#x8FDB;&#x9879;&#x76EE;&#xFF0C;&#x53C2;&#x4E0E;&#x5230;&#x6982;&#x8981;&#x8BBE;&#x8BA1;&#x548C;&#x8BE6;&#x7EC6;&#x8BBE;&#x8BA1;&#x7684;&#x8BC4;&#x5BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6839;&#x636E;&#x6982;&#x8981;&#x8BBE;&#x8BA1;&#x6587;&#x6863;&#x7F16;&#x5199;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#xFF0C;&#x6839;&#x636E;&#x8BE6;&#x7EC6;&#x8BBE;&#x8BA1;&#x6587;&#x6863;&#x7F16;&#x5199;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7F16;&#x7801;&#x4E4B;&#x540E;&#xFF0C;&#x8981;&#x8FDB;&#x884C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF0C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7684;&#x4F9D;&#x636E;&#x662F;&#x6839;&#x636E;&#x8BE6;&#x7EC6;&#x8BBE;&#x8BA1;&#x4EA7;&#x751F;&#x7684;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#x3002;&#x6839;&#x636E;&#x56FD;&#x5185;&#x7684;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#xFF0C;&#x9664;&#x4E86;&#x822A;&#x5929;&#x3001;&#x533B;&#x7597;&#x3001;&#x519B;&#x5DE5;&#x7B49;&#x5BF9;&#x8F6F;&#x4EF6;&#x8981;&#x6C42;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x884C;&#x4E1A;&#xFF0C;&#x5176;&#x4ED6;&#x884C;&#x4E1A;&#x7684;&#x9879;&#x76EE;&#x5F80;&#x5F80;&#x90FD;&#x662F;&#x7531;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8FDB;&#x884C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7531;&#x4E13;&#x4E1A;&#x7684;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x5B9E;&#x65BD;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7684;&#x3002;</p>
<h4 id="4&#xFF0E;&#x5355;&#x5143;&#x3001;&#x96C6;&#x6210;&#x3001;&#x7CFB;&#x7EDF;&#x548C;&#x9A8C;&#x6536;&#x6D4B;&#x8BD5;">4&#xFF0E;&#x5355;&#x5143;&#x3001;&#x96C6;&#x6210;&#x3001;&#x7CFB;&#x7EDF;&#x548C;&#x9A8C;&#x6536;&#x6D4B;&#x8BD5;</h4>
<p>&#x2003;&#x2003;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7ED3;&#x675F;&#x4EE5;&#x540E;&#xFF0C;&#x8981;&#x5F62;&#x6210;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x62A5;&#x544A;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x8FDB;&#x5165;&#x5230;&#x96C6;&#x6210;&#x3001;&#x7CFB;&#x7EDF;&#x3001;&#x9A8C;&#x6536;&#x6D4B;&#x8BD5;&#x9636;&#x6BB5;&#xFF0C;&#x5176;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x5982;&#x56FE;10.8&#x6240;&#x793A;&#x3002;</p>
<p align="center"><img src="../img/d10z/tu10.8.png"></p>  
<p align="center">&#x56FE;10.8  &#x96C6;&#x6210;&#x3001;&#x7CFB;&#x7EDF;&#x548C;&#x9A8C;&#x6536;&#x9636;&#x6BB5;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;</p>  



<p>&#x2003;&#x2003;&#x8FDB;&#x5165;&#x8FD9;&#x4E00;&#x9636;&#x6BB5;&#xFF0C;&#x6295;&#x5165;&#x7684;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x6570;&#x91CF;&#x5C06;&#x4F1A;&#x8FC5;&#x901F;&#x589E;&#x52A0;&#xFF0C;&#x56E0;&#x4E3A;&#x4ECE;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x5F00;&#x59CB;&#xFF0C;&#x6D4B;&#x8BD5;&#x5DE5;&#x4F5C;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x662F;&#x7531;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x7684;&#x4F9D;&#x636E;&#x662F;&#x6839;&#x636E;&#x6982;&#x8981;&#x8BBE;&#x8BA1;&#x4EA7;&#x751F;&#x7684;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#xFF0C;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x7684;&#x4F9D;&#x636E;&#x662F;&#x6839;&#x636E;&#x9700;&#x6C42;&#x5206;&#x6790;&#x4EA7;&#x751F;&#x7684;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#x3002;&#x7ECF;&#x8FC7;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x548C;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x4E4B;&#x540E;&#xFF0C;&#x5C06;&#x8FDB;&#x5165;&#x7531;&#x7528;&#x6237;&#x5B9E;&#x65BD;&#x7684;&#x9A8C;&#x6536;&#x6D4B;&#x8BD5;&#xFF0C;&#x6700;&#x540E;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x5DE5;&#x4F5C;&#x603B;&#x7ED3;&#x548C;&#x6587;&#x6863;&#x6574;&#x7406;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x2003;&#x2003;&#x901A;&#x8FC7;&#x4EE5;&#x4E0A;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7ED3;&#x8BBA;&#xFF1A;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x4F5C;&#x8D2F;&#x7A7F;&#x4E86;&#x6574;&#x4E2A;&#x8F6F;&#x4EF6;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x6E17;&#x900F;&#x5230;&#x4ECE;&#x5206;&#x6790;&#x3001;&#x8BBE;&#x8BA1;&#x3001;&#x7F16;&#x7A0B;&#x4EE5;&#x53CA;&#x6D4B;&#x8BD5;&#x7684;&#x5404;&#x4E2A;&#x9636;&#x6BB5;&#x4E2D;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4ECE;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x7684;&#x9636;&#x6BB5;&#x4E0A;&#x5206;&#x6790;&#xFF0C;&#x53EF;&#x5C06;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5206;&#x4E3A;&#x540C;&#x7B49;&#x91CD;&#x8981;&#x7684;3&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x5373;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3001;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x548C;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#xFF08;&#x542B;&#x786E;&#x8BA4;&#x6D4B;&#x8BD5;&#xFF09;&#x3002;&#x6D4B;&#x8BD5;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x7B2C;&#x56DB;&#x4E2A;&#x9636;&#x6BB5;&#x662F;&#x9A8C;&#x6536;&#x6D4B;&#x8BD5;&#x9636;&#x6BB5;&#xFF0C;&#x9A8C;&#x6536;&#x6D4B;&#x8BD5;&#x5728;&#x6027;&#x8D28;&#x4E0A;&#x548C;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x5F88;&#x76F8;&#x4F3C;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x6839;&#x672C;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x524D;&#x8005;&#x662F;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x7684;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x5219;&#x662F;&#x53D7;&#x7528;&#x6237;&#x63A7;&#x5236;&#x7684;&#xFF0C;&#x5177;&#x4F53;&#x5185;&#x5BB9;&#x5982;&#x56FE;10.9&#x6240;&#x793A;&#x3002;</p>
<ul>
<li>&#x5355;&#x5143;&#x6D4B;&#x8BD5;</li>
</ul>
<p>&#x2003;&#x2003;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x53C8;&#x79F0;&#x6A21;&#x5757;&#x6D4B;&#x8BD5;&#xFF0C;&#x662F;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x662F;&#x5728;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x8FDB;&#x884C;&#x7684;&#x6D4B;&#x8BD5;&#x6D3B;&#x52A8;&#x3002;&#x5728;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x6D3B;&#x52A8;&#x4E2D;&#xFF0C;&#x5404;&#x72EC;&#x7ACB;&#x5355;&#x5143;&#x6A21;&#x5757;&#x5C06;&#x5728;&#x4E0E;&#x7CFB;&#x7EDF;&#x7684;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x76F8;&#x9694;&#x79BB;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x9488;&#x5BF9;&#x6BCF;&#x4E2A;&#x7A0B;&#x5E8F;&#x6A21;&#x5757;&#x8FDB;&#x884C;&#x6B63;&#x786E;&#x6027;&#x68C0;&#x9A8C;&#xFF0C;&#x68C0;&#x67E5;&#x6BCF;&#x4E2A;&#x7A0B;&#x5E8F;&#x6A21;&#x5757;&#x662F;&#x5426;&#x6B63;&#x786E;&#x5730;&#x5B9E;&#x73B0;&#x4E86;&#x89C4;&#x5B9A;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x7C7B;&#x3001;&#x63A5;&#x53E3;&#x3001;&#x65B9;&#x6CD5;&#x3001;&#x62A5;&#x8868;&#x6216;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x90FD;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5355;&#x5143;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x662F;&#x6D4B;&#x8BD5;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x5176;&#x4F9D;&#x636E;&#x662F;&#x8BE6;&#x7EC6;&#x8BBE;&#x8BA1;&#xFF0C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x5E94;&#x5BF9;&#x6A21;&#x5757;&#x5185;&#x6240;&#x6709;&#x91CD;&#x8981;&#x7684;&#x63A7;&#x5236;&#x8DEF;&#x5F84;&#x8BBE;&#x8BA1;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#xFF0C;&#x4EE5;&#x4FBF;&#x53D1;&#x73B0;&#x6A21;&#x5757;&#x5185;&#x90E8;&#x7684;&#x9519;&#x8BEF;&#x3002;</p>
<p align="center"><img src="../img/d10z/tu10.9.png"></p>  
<p align="center">&#x56FE;10.9  &#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x8FC7;&#x7A0B;</p>  



<ul>
<li>&#x96C6;&#x6210;&#x6D4B;&#x8BD5;</li>
</ul>
<p>&#x2003;&#x2003;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x662F;&#x5728;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5C06;&#x5DF2;&#x7ECF;&#x901A;&#x8FC7;&#x6D4B;&#x8BD5;&#x7684;&#x5355;&#x5143;&#x6A21;&#x5757;&#x6309;&#x7167;&#x8BBE;&#x8BA1;&#x8981;&#x6C42;&#x7EC4;&#x88C5;&#x6210;&#x7CFB;&#x7EDF;&#x6216;&#x5B50;&#x7CFB;&#x7EDF;&#x518D;&#x8FDB;&#x884C;&#x7684;&#x6D4B;&#x8BD5;&#x3002;&#x5F88;&#x591A;&#x5B9E;&#x9645;&#x4F8B;&#x5B50;&#x8868;&#x660E;&#xFF0C;&#x8F6F;&#x4EF6;&#x7684;&#x4E00;&#x4E9B;&#x6A21;&#x5757;&#x867D;&#x7136;&#x80FD;&#x591F;&#x5355;&#x72EC;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x4FDD;&#x8BC1;&#x8FDE;&#x63A5;&#x4E4B;&#x540E;&#x4E5F;&#x80AF;&#x5B9A;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x53EF;&#x80FD;&#x5BF9;&#x53E6;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x4EA7;&#x751F;&#x4E0D;&#x5229;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5C06;&#x5B50;&#x529F;&#x80FD;&#x5408;&#x6210;&#x65F6;&#x4E0D;&#x4E00;&#x5B9A;&#x4EA7;&#x751F;&#x6240;&#x671F;&#x671B;&#x7684;&#x4E3B;&#x529F;&#x80FD;&#xFF0C;&#x72EC;&#x7ACB;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x8BEF;&#x5DEE;&#x5728;&#x7EC4;&#x88C5;&#x540E;&#x53EF;&#x80FD;&#x4F1A;&#x8D85;&#x8FC7;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x8BEF;&#x5DEE;&#x9650;&#x5EA6;&#x7B49;&#x3002;</p>
<ul>
<li>&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;</li>
</ul>
<p>&#x2003;&#x2003;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x662F;&#x5C06;&#x7ECF;&#x8FC7;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x4F5C;&#x4E3A;&#x6574;&#x4E2A;&#x57FA;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x4E0E;&#x8BA1;&#x7B97;&#x673A;&#x786C;&#x4EF6;&#x3001;&#x5916;&#x8BBE;&#x3001;&#x67D0;&#x4E9B;&#x652F;&#x6301;&#x8F6F;&#x4EF6;&#x3001;&#x6570;&#x636E;&#x548C;&#x4EBA;&#x5458;&#x7B49;&#x5176;&#x4ED6;&#x7CFB;&#x7EDF;&#x5143;&#x7D20;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x5168;&#x9762;&#x7684;&#x529F;&#x80FD;&#x8986;&#x76D6;&#x6D4B;&#x8BD5;&#x3002;</p>
<p>&#x2003;&#x2003;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x901A;&#x8FC7;&#x5B9E;&#x65BD;&#x9884;&#x5B9A;&#x7684;&#x6D4B;&#x8BD5;&#x8BA1;&#x5212;&#x548C;&#x6D4B;&#x8BD5;&#x6B65;&#x9AA4;&#xFF0C;&#x786E;&#x5B9A;&#x8F6F;&#x4EF6;&#x7684;&#x7279;&#x6027;&#x662F;&#x5426;&#x4E0E;&#x9700;&#x6C42;&#x76F8;&#x7B26;&#xFF0C;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x7684;&#x8F6F;&#x4EF6;&#x529F;&#x80FD;&#x9700;&#x6C42;&#x90FD;&#x80FD;&#x5F97;&#x5230;&#x6EE1;&#x8DB3;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8F6F;&#x4EF6;&#x6027;&#x80FD;&#x9700;&#x6C42;&#x90FD;&#x80FD;&#x8FBE;&#x5230;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6587;&#x6863;&#x90FD;&#x662F;&#x6B63;&#x786E;&#x4E14;&#x4FBF;&#x4E8E;&#x4F7F;&#x7528;&#x7684;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5BF9;&#x5176;&#x4ED6;&#x8F6F;&#x4EF6;&#x9700;&#x6C42;&#xFF0C;&#x5982;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x3001;&#x517C;&#x5BB9;&#x6027;&#x3001;&#x51FA;&#x9519;&#x81EA;&#x52A8;&#x6062;&#x590D;&#x3001;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x7B49;&#xFF0C;&#x4E5F;&#x90FD;&#x8981;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#xFF0C;&#x786E;&#x8BA4;&#x662F;&#x5426;&#x6EE1;&#x8DB3;&#x3002;</p>
<ul>
<li>&#x9A8C;&#x6536;&#x6D4B;&#x8BD5;</li>
</ul>
<p>&#x2003;&#x2003;&#x9A8C;&#x6536;&#x6D4B;&#x8BD5;&#x662F;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x4EA4;&#x4ED8;&#x7528;&#x6237;&#x6B63;&#x5F0F;&#x4F7F;&#x7528;&#x524D;&#x7684;&#x6700;&#x540E;&#x4E00;&#x9053;&#x5DE5;&#x5E8F;&#x3002;&#x5B83;&#x662F;&#x4EE5;&#x7528;&#x6237;&#x4E3A;&#x4E3B;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x548C;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x4E5F;&#x5E94;&#x53C2;&#x52A0;&#x3002;&#x7531;&#x7528;&#x6237;&#x53C2;&#x52A0;&#x8BBE;&#x8BA1;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#xFF0C;&#x4F7F;&#x7528;&#x7528;&#x6237;&#x754C;&#x9762;&#x8F93;&#x5165;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x5206;&#x6790;&#x6D4B;&#x8BD5;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x4E00;&#x822C;&#x4F7F;&#x7528;&#x751F;&#x4EA7;&#x4E2D;&#x7684;&#x5B9E;&#x9645;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;</p>
<p>&#x2003;&#x2003;&#x9A8C;&#x6536;&#x6D4B;&#x8BD5;&#x7684;&#x76EE;&#x7684;&#x662F;&#x5411;&#x7528;&#x6237;&#x8BC1;&#x660E;&#x4EA7;&#x54C1;&#x662F;&#x53EF;&#x9760;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x505A;&#x5230;&#x8FD9;&#x70B9;&#xFF0C;&#x9A8C;&#x6536;&#x6D4B;&#x8BD5;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#x7684;&#x6761;&#x4EF6;&#x662F;&#x96C6;&#x4E2D;&#x8FDB;&#x884C;&#x7528;&#x6237;&#x9700;&#x6C42;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x4E14;&#x5FC5;&#x987B;&#x7531;&#x7528;&#x6237;&#x6216;&#x7528;&#x6237;&#x4EE3;&#x8868;&#x53C2;&#x52A0;&#xFF0C;&#x5E76;&#x5728;&#x6B63;&#x5E38;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;&#x9A8C;&#x6536;&#x6D4B;&#x8BD5;&#x4E00;&#x822C;&#x7531;&#x7528;&#x6237;&#x6267;&#x884C;&#xFF0C;&#x5982;&#x679C;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x5747;&#x6267;&#x884C;&#x901A;&#x8FC7;&#xFF0C;&#x5219;&#x8BF4;&#x660E;&#x7CFB;&#x7EDF;&#x662F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x548C;&#x80FD;&#x591F;&#x53D1;&#x884C;&#x7684;&#x3002;&#x9A8C;&#x6536;&#x6807;&#x51C6;&#x5FC5;&#x987B;&#x5728;&#x539F;&#x59CB;&#x7684;&#x9700;&#x6C42;&#x89C4;&#x8303;&#x4E2D;&#x6216;&#x5728;&#x4E0E;&#x5BA2;&#x6237;&#x7B7E;&#x8BA2;&#x7684;&#x5408;&#x540C;&#x4E2D;&#x89C4;&#x5B9A;&#x3002;</p>
<h3 id="1045--&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5206;&#x7C7B;">10.4.5  &#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5206;&#x7C7B;</h3>
<p>&#x2003;&#x2003;&#x6839;&#x636E;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x6240;&#x5C5E;&#x7684;&#x9636;&#x6BB5;&#x548C;&#x88AB;&#x6D4B;&#x5BF9;&#x8C61;&#x7684;&#x89C4;&#x6A21;&#x5927;&#x5C0F;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5206;&#x4E3A;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3001;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x3001;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x548C;&#x9A8C;&#x6536;&#x6D4B;&#x8BD5;&#x3002;&#x4ECE;&#x5176;&#x4ED6;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x53C8;&#x53EF;&#x4EE5;&#x5C06;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5206;&#x4E3A;&#x9ED1;&#x76D2;&#x6D4B;&#x8BD5;&#x548C;&#x767D;&#x76D2;&#x6D4B;&#x8BD5;&#xFF0C;&#x624B;&#x5DE5;&#x6D4B;&#x8BD5;&#x548C;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C06;&#x7B80;&#x8981;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x3002;</p>
<h4 id="1&#xFF0E;&#x9ED1;&#x76D2;&#x6D4B;&#x8BD5;&#x548C;&#x767D;&#x76D2;&#x6D4B;&#x8BD5;">1&#xFF0E;&#x9ED1;&#x76D2;&#x6D4B;&#x8BD5;&#x548C;&#x767D;&#x76D2;&#x6D4B;&#x8BD5;</h4>
<p>&#x2003;&#x2003;&#x9ED1;&#x76D2;&#x6D4B;&#x8BD5;&#x53C8;&#x79F0;&#x529F;&#x80FD;&#x6D4B;&#x8BD5;&#xFF0C;&#x5B83;&#x6CE8;&#x91CD;&#x4E8E;&#x6D4B;&#x8BD5;&#x8F6F;&#x4EF6;&#x7684;&#x529F;&#x80FD;&#x6027;&#x9700;&#x6C42;&#x3002;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x6D4B;&#x8BD5;&#x65B9;&#x6CD5;&#xFF0C;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x4F1A;&#x628A;&#x88AB;&#x6D4B;&#x7A0B;&#x5E8F;&#x770B;&#x6210;&#x4E00;&#x4E2A;&#x9ED1;&#x76D2;&#xFF0C;&#x5B8C;&#x5168;&#x4E0D;&#x8003;&#x8651;&#x7A0B;&#x5E8F;&#x7684;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#x548C;&#x7279;&#x6027;&#xFF0C;&#x53EA;&#x9700;&#x77E5;&#x9053;&#x8BE5;&#x7A0B;&#x5E8F;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x6216;&#x7A0B;&#x5E8F;&#x529F;&#x80FD;&#xFF0C;&#x6765;&#x786E;&#x5B9A;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x548C;&#x63A8;&#x65AD;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x7684;&#x6B63;&#x786E;&#x6027;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4F8B;&#x5982;&#x8981;&#x6D4B;&#x8BD5;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x9700;&#x6C42;&#x89C4;&#x683C;&#x8BF4;&#x660E;&#x4E66;&#x89C4;&#x5B9A;&#xFF0C;&#x5F53;&#x8F93;&#x5165;&#x503C;&#x4E3A;16&#x65F6;&#xFF0C;&#x5355;&#x51FB;&#x201C;&#x8BA1;&#x7B97;&#x201D;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4E3A;4&#xFF1B;&#x5F53;&#x8F93;&#x5165;&#x503C;&#x4E3A;4&#x65F6;&#xFF0C;&#x5355;&#x51FB;&#x201C;&#x8BA1;&#x7B97;&#x201D;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4E3A;2&#x3002;&#x4F5C;&#x4E3A;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x6839;&#x636E;&#x9700;&#x6C42;&#x8BBE;&#x8BA1;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x5982;&#x4E0B;&#x3002;</p>
<p>&#x2003;&#x2003;&#x2460; &#x8F93;&#x5165;&#x503C;&#xFF1A;16&#xFF0C;&#x5355;&#x51FB;&#x201C;&#x8BA1;&#x7B97;&#x201D;&#xFF0C;&#x9884;&#x671F;&#x7ED3;&#x679C;&#xFF1A;4&#x3002;</p>
<p>&#x2003;&#x2003;&#x2461; &#x8F93;&#x5165;&#x503C;&#xFF1A;4&#xFF0C;&#x5355;&#x51FB;&#x201C;&#x8BA1;&#x7B97;&#x201D;&#xFF0C;&#x9884;&#x671F;&#x7ED3;&#x679C;&#xFF1A;2&#x3002;</p>
<p>&#x2003;&#x2003;&#x6267;&#x884C;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#xFF0C;&#x770B;&#x7A0B;&#x5E8F;&#x5B9E;&#x9645;&#x8FD0;&#x884C;&#x7ED3;&#x679C;&#x548C;&#x9884;&#x671F;&#x7ED3;&#x679C;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x81F4;&#x5219;&#x8BE5;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x6267;&#x884C;&#x901A;&#x8FC7;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x5219;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x7F3A;&#x9677;&#xFF0C;&#x8981;&#x63D0;&#x4EA4;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x7ED9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x6D4B;&#x8BD5;&#x5C31;&#x662F;&#x5178;&#x578B;&#x7684;&#x9ED1;&#x76D2;&#x6D4B;&#x8BD5;&#x3002;</p>
<p>&#x2003;&#x2003;&#x767D;&#x76D2;&#x6D4B;&#x8BD5;&#x53C8;&#x79F0;&#x7ED3;&#x6784;&#x6D4B;&#x8BD5;&#x3001;&#x903B;&#x8F91;&#x9A71;&#x52A8;&#x6D4B;&#x8BD5;&#x3002;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x628A;&#x88AB;&#x6D4B;&#x8BD5;&#x7A0B;&#x5E8F;&#x770B;&#x6210;&#x4E00;&#x4E2A;&#x6253;&#x5F00;&#x7684;&#x76D2;&#x5B50;&#xFF0C;&#x80FD;&#x591F;&#x770B;&#x5230;&#x7A0B;&#x5E8F;&#x7684;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#xFF0C;&#x6839;&#x636E;&#x7A0B;&#x5E8F;&#x7684;&#x5185;&#x5BB9;&#x6765;&#x8BBE;&#x8BA1;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x3002;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x6D4B;&#x8BD5;&#x65B9;&#x6CD5;&#xFF0C;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x9700;&#x8981;&#x5BF9;&#x88AB;&#x6D4B;&#x8BD5;&#x7A0B;&#x5E8F;&#x975E;&#x5E38;&#x6E05;&#x695A;&#xFF0C;&#x4ECE;&#x7A0B;&#x5E8F;&#x7684;&#x5185;&#x90E8;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#x5165;&#x624B;&#xFF0C;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x7684;&#x539F;&#x5219;&#x8BBE;&#x8BA1;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#xFF0C;&#x6D4B;&#x8BD5;&#x8F6F;&#x4EF6;&#x7684;&#x4EE3;&#x7801;&#x548C;&#x903B;&#x8F91;&#x8DEF;&#x5F84;&#xFF0C;&#x4EE5;&#x5224;&#x5B9A;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x60C5;&#x51B5;&#x662F;&#x5426;&#x548C;&#x9884;&#x671F;&#x7ED3;&#x679C;&#x4E00;&#x81F4;&#x3002;</p>
<p>&#x2003;&#x2003;&#x767D;&#x76D2;&#x6D4B;&#x8BD5;&#x8981;&#x5C3D;&#x91CF;&#x63D0;&#x9AD8;&#x5BF9;&#x7A0B;&#x5E8F;&#x7ED3;&#x6784;&#x7684;&#x8986;&#x76D6;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x65B9;&#x6CD5;&#x5305;&#x62EC;&#x8BED;&#x53E5;&#x8986;&#x76D6;&#x3001;&#x5206;&#x652F;&#x8986;&#x76D6;&#x6216;&#x5224;&#x65AD;&#x8986;&#x76D6;&#x3001;&#x6761;&#x4EF6;&#x8986;&#x76D6;&#x3001;&#x5224;&#x65AD;/&#x6761;&#x4EF6;&#x8986;&#x76D6;&#x3001;&#x8DEF;&#x5F84;&#x8986;&#x76D6;&#xFF0C;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x67E5;&#x9605;&#x76F8;&#x5173;&#x8D44;&#x6599;&#x3002;</p>
<h4 id="2&#xFF0E;&#x624B;&#x5DE5;&#x6D4B;&#x8BD5;&#x548C;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;">2&#xFF0E;&#x624B;&#x5DE5;&#x6D4B;&#x8BD5;&#x548C;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;</h4>
<p>&#x2003;&#x2003;&#x624B;&#x5DE5;&#x6D4B;&#x8BD5;&#x662F;&#x4F20;&#x7EDF;&#x7684;&#x6D4B;&#x8BD5;&#x65B9;&#x6CD5;&#xFF0C;&#x4E5F;&#x662F;&#x73B0;&#x5728;&#x5927;&#x591A;&#x6570;&#x516C;&#x53F8;&#x90FD;&#x4F7F;&#x7528;&#x7684;&#x6D4B;&#x8BD5;&#x5F62;&#x5F0F;&#x3002;&#x5B83;&#x7531;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x6765;&#x6267;&#x884C;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5B9E;&#x9645;&#x7ED3;&#x679C;&#x548C;&#x9884;&#x671F;&#x7ED3;&#x679C;&#x76F8;&#x6BD4;&#x8F83;&#xFF0C;&#x53D1;&#x73B0;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x3002;</p>
<p>&#x2003;&#x2003;&#x63D0;&#x5230;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x4F1A;&#x76F4;&#x63A5;&#x60F3;&#x5230;&#x4F7F;&#x7528;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#xFF0C;&#x8BA4;&#x4E3A;&#x53EA;&#x8981;&#x8D2D;&#x7F6E;&#x4E00;&#x79CD;&#x6D41;&#x884C;&#x7684;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#xFF0C;&#x6267;&#x884C;&#x8BB0;&#x5F55;&#x624B;&#x5DE5;&#x6D4B;&#x8BD5;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x9700;&#x8981;&#x65F6;&#x56DE;&#x653E;&#x5F55;&#x5236;&#x8FC7;&#x7A0B;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x901A;&#x8FC7;&#x5B9E;&#x8DF5;&#x53D1;&#x73B0;&#xFF0C;&#x4E8B;&#x5B9E;&#x5E76;&#x975E;&#x5982;&#x6B64;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x2003;&#x2003;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x5728;&#x624B;&#x5DE5;&#x6267;&#x884C;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x5F88;&#x591A;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x7684;&#x6267;&#x884C;&#x6B65;&#x9AA4;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x4F46;&#x8F93;&#x5165;&#x6570;&#x636E;&#x548C;&#x9884;&#x671F;&#x7ED3;&#x679C;&#x4E0D;&#x540C;&#x3002;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x9700;&#x8981;&#x53CD;&#x590D;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#xFF0C;&#x8F93;&#x5165;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5224;&#x65AD;&#x5B9E;&#x9645;&#x7ED3;&#x679C;&#x548C;&#x9884;&#x671F;&#x7ED3;&#x679C;&#x7684;&#x5DEE;&#x5F02;&#x3002;&#x8FD9;&#x6837;&#x4F1A;&#x8BA9;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x89C9;&#x5F97;&#x6BD4;&#x8F83;&#x67AF;&#x71E5;&#xFF0C;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x7684;&#x6548;&#x7387;&#x6BD4;&#x8F83;&#x4F4E;&#x3002;</p>
<p>&#x2003;&#x2003;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#x91C7;&#x7528;&#x5F55;&#x5236;&#x3001;&#x56DE;&#x653E;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5C06;&#x591A;&#x7EC4;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x7684;&#x6570;&#x636E; &#x3001;&#x9884;&#x671F;&#x7ED3;&#x679C;&#x6570;&#x91CF;&#x8F93;&#x5165;&#x5230;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#xFF08;&#x4F8B;&#x5982;QTP&#xFF09;&#x4E2D;&#xFF0C;&#x8BA9;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x5165;&#x6570;&#x636E;&#x53CD;&#x590D;&#x6267;&#x884C;&#x6D4B;&#x8BD5;&#x6B65;&#x9AA4;&#xFF0C;&#x5224;&#x65AD;&#x9884;&#x671F;&#x7ED3;&#x679C;&#x548C;&#x5B9E;&#x9645;&#x7ED3;&#x679C;&#x7684;&#x5DEE;&#x5F02;&#x3002;&#x6709;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#x53EF;&#x4EE5;&#x5728;&#x8F83;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x5B8C;&#x6210;&#x624B;&#x5DE5;&#x6D4B;&#x8BD5;&#x51E0;&#x5C0F;&#x65F6;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4ECE;&#x67D0;&#x79CD;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#x53EF;&#x4EE5;&#x4E3A;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x4F5C;&#x8282;&#x7701;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x5F00;&#x9500;&#x3002;&#x6210;&#x719F;&#x7684;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#x673A;&#x5236;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x4F11;&#x606F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6267;&#x884C;&#x201C;&#x591C;&#x95F4;&#x6D4B;&#x8BD5;&#x201D;&#xFF0C;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x9700;&#x8981;&#x63D0;&#x9192;&#x5927;&#x5BB6;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x8BF4;&#x6CD5;&#x662F;&#x76F8;&#x5BF9;&#x7684;&#xFF0C;&#x5E76;&#x4E0D;&#x5177;&#x6709;&#x666E;&#x904D;&#x6027;&#x3002;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x88AB;&#x6D4B;&#x8F6F;&#x4EF6;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x662F;&#x4E0D;&#x7A33;&#x5B9A;&#x7684;&#xFF0C;&#x5219;&#x4E4B;&#x524D;&#x5F55;&#x5236;&#x7684;&#x811A;&#x672C;&#x5728;&#x65B0;&#x7684;&#x754C;&#x9762;&#x4E0B;&#x5C31;&#x4E0D;&#x80FD;&#x56DE;&#x8BBF;&#xFF0C;&#x4E5F;&#x5C31;&#x65E0;&#x6CD5;&#x63D0;&#x9AD8;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x9488;&#x5BF9;&#x6709;&#x4E9B;&#x88AB;&#x6D4B;&#x8F6F;&#x4EF6;&#xFF0C;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#x7684;&#x652F;&#x6301;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#xFF0C;&#x4F1A;&#x51FA;&#x73B0;&#x4E0D;&#x8BC6;&#x522B;&#x5BF9;&#x8C61;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5BFC;&#x81F4;&#x4E0D;&#x80FD;&#x5F55;&#x5236;&#x3001;&#x56DE;&#x8BBF;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5F55;&#x5236;&#x3001;&#x7EF4;&#x62A4;&#x8FD9;&#x4E9B;&#x6D4B;&#x8BD5;&#x811A;&#x672C;&#x4E5F;&#x9700;&#x8981;&#x5F88;&#x5927;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x53EA;&#x662F;&#x9488;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x9488;&#x5BF9;&#x4EA7;&#x54C1;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x4E0D;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#x3002;</p>
<p>&#x2003;&#x2003;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#x7684;&#x5F15;&#x5165;&#xFF0C;&#x5BF9;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x53EF;&#x4EE5;&#x8BF4;&#x975E;&#x5E38;&#x6709;&#x5FC5;&#x8981;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x6D4B;&#x8BD5;&#x4E00;&#x4E2A;&#x8003;&#x8BD5;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E0C;&#x671B;&#x8FD9;&#x4E2A;&#x8003;&#x8BD5;&#x7CFB;&#x7EDF;&#x80FD;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x70B9;&#xFF0C;&#x5141;&#x8BB8;100&#x4E2A;&#x7528;&#x6237;&#x540C;&#x65F6;&#x767B;&#x5F55;&#xFF0C;&#x4E14;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x767B;&#x5F55;&#x7684;&#x5E73;&#x5747;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x4F4E;&#x4E8E;5&#x79D2;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x7528;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#xFF0C;&#x90A3;&#x5C31;&#x53EA;&#x627E;100&#x4E2A;&#x4EBA;&#xFF0C;&#x8BA9;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5DE5;&#x7A0B;&#x5E08;&#x4E00;&#x58F0;&#x4EE4;&#x4E0B;&#xFF0C;&#x8FD9;100&#x4E2A;&#x4EBA;&#x540C;&#x65F6;&#x767B;&#x5F55;&#x8FD9;&#x4E2A;&#x8003;&#x8BD5;&#x7CFB;&#x7EDF;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x8FD8;&#x9700;&#x7528;&#x79D2;&#x8868;&#x8BB0;&#x5F55;&#x7528;&#x6237;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x73A9;&#x7B11;&#xFF01;&#x4F46;&#x4F7F;&#x7528;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#x4E2D;&#x7684;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#xFF0C;&#x4F8B;&#x5982;LoadRunner&#xFF0C;&#x5C31;&#x80FD;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x5730;&#x505A;&#x5230;&#x521A;&#x624D;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<h2 id="105--&#x7EBF;&#x7A0B;&#x6B7B;&#x9501;&#x548C;&#x534F;&#x4F5C;">10.5  &#x7EBF;&#x7A0B;&#x6B7B;&#x9501;&#x548C;&#x534F;&#x4F5C;</h2>
<p>&#x2003;&#x2003;&#x591A;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#xFF0C;&#x89E3;&#x51B3;&#x7684;&#x662F;&#x591A;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x6027;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x907F;&#x514D;&#x83B7;&#x53D6;&#x9519;&#x8BEF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x540C;&#x6B65;&#x4E5F;&#x540C;&#x65F6;&#x4F1A;&#x5E26;&#x6765;&#x6027;&#x80FD;&#x635F;&#x8017;&#x548C;&#x7EBF;&#x7A0B;&#x6B7B;&#x9501;&#x7684;&#x95EE;&#x9898;&#x3002;&#x672C;&#x8282;&#x901A;&#x8FC7;&#x6848;&#x4F8B;&#x6F14;&#x793A;&#x4EC0;&#x4E48;&#x662F;&#x7EBF;&#x7A0B;&#x6B7B;&#x9501;&#xFF0C;&#x5E76;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x89E3;&#x51B3;&#x7EBF;&#x7A0B;&#x6B7B;&#x9501;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x89E3;&#x51B3;&#x4E86;&#x591A;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x95EE;&#x9898;&#x540E;&#xFF0C;&#x672C;&#x8282;&#x8FD8;&#x4F1A;&#x4ECB;&#x7ECD;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x534F;&#x4F5C;&#xFF0C;&#x901A;&#x8FC7;&#x591A;&#x7EBF;&#x7A0B;&#x95F4;&#x7684;&#x534F;&#x4F5C;&#x5B8C;&#x6210;&#x7CFB;&#x7EDF;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<h3 id="1051--&#x7EBF;&#x7A0B;&#x6B7B;&#x9501;">10.5.1  &#x7EBF;&#x7A0B;&#x6B7B;&#x9501;</h3>
<p>&#x2003;&#x2003;&#x591A;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x7684;&#x597D;&#x5904;&#x662F;&#x907F;&#x514D;&#x4E86;&#x7EBF;&#x7A0B;&#x83B7;&#x53D6;&#x9519;&#x8BEF;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x591A;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x4E5F;&#x5E26;&#x6765;&#x4E86;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x3002;&#x591A;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x91C7;&#x7528;&#x4E86;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#x5757;&#x548C;&#x540C;&#x6B65;&#x65B9;&#x6CD5;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4F9D;&#x9760;&#x7684;&#x662F;&#x9501;&#x673A;&#x5236;&#x5B9E;&#x73B0;&#x4E86;&#x4E92;&#x65A5;&#x8BBF;&#x95EE;&#x3002;&#x56E0;&#x4E3A;&#x662F;&#x4E92;&#x65A5;&#x7684;&#x8BBF;&#x95EE;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x5E76;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x5B58;&#x5728;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x2003;&#x2003;&#x591A;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x7684;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x8FD8;&#x53EA;&#x662F;&#x5FEB;&#x548C;&#x6162;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x4E86;&#x7EBF;&#x7A0B;&#x6B7B;&#x9501;&#xFF0C;&#x90A3;&#x53EF;&#x80FD;&#x76F4;&#x63A5;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x4F17;&#x591A;&#x7684;&#x7EBF;&#x7A0B;&#x90FD;&#x5904;&#x4E8E;&#x963B;&#x585E;&#x72B6;&#x6001;&#xFF0C;&#x65E0;&#x6CD5;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5982;&#x679C;&#x7EBF;&#x7A0B;A&#x53EA;&#x6709;&#x7B49;&#x5F85;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;B&#x7684;&#x5B8C;&#x6210;&#x624D;&#x80FD;&#x7EE7;&#x7EED;&#xFF0C;&#x800C;&#x5728;&#x7EBF;&#x7A0B;B&#x4E2D;&#x53C8;&#x8981;&#x7B49;&#x5F85;&#x7EBF;&#x7A0B;A&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x76F8;&#x4E92;&#x7B49;&#x5F85;&#x5BF9;&#x65B9;&#x91CA;&#x653E;&#x9501;&#x65F6;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x6B7B;&#x9501;&#x3002;&#x51FA;&#x73B0;&#x6B7B;&#x9501;&#x540E;&#xFF0C;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x5F02;&#x5E38;&#xFF0C;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x63D0;&#x793A;&#xFF0C;&#x53EA;&#x662F;&#x76F8;&#x5173;&#x7EBF;&#x7A0B;&#x90FD;&#x5904;&#x4E8E;&#x963B;&#x585E;&#x72B6;&#x6001;&#xFF0C;&#x65E0;&#x6CD5;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E0B;&#x9762;&#x4ECD;&#x7136;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x6848;&#x4F8B;&#x6765;&#x6F14;&#x793A;&#x7EBF;&#x7A0B;&#x7684;&#x6B7B;&#x9501;&#xFF0C;&#x5177;&#x4F53;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>public class DeadLockThread{

//&#x521B;&#x5EFA;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x7ADE;&#x4E89;&#x4F7F;&#x7528;&#x7684;&#x5BF9;&#x8C61;

private static Object lock1 = new Object();

private static Object lock2 = new Object();

public static void main(String[] args){

new Thread(new ShareThread1()).start();

new Thread(new ShareThread2()).start();

}

private static class ShareThread1 implements Runnable

{

public void run(){

synchronized(lock1){

try{

Thread.sleep(50);

}catch(InterruptedException e)

{

e.printStackTrace();

}

synchronized(lock2){

System.out.println(&quot;ShareThread1&quot;);

}

}

}

}

private static class ShareThread2 implements Runnable

{

public void run(){

synchronized(lock2){

try{

Thread.sleep(50);

}catch(InterruptedException e)

{

e.printStackTrace();

}

synchronized(lock1){

System.out.println(&quot;ShareThread2&quot;);

}

}

}

}

}
</code></pre><p>&#x2003;&#x2003;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x521B;&#x5EFA;&#x4E86;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x7ADE;&#x4E89;&#x4F7F;&#x7528;&#x7684;&#x5BF9;&#x8C61;lock1&#x548C;lock2&#xFF0C;&#x5185;&#x90E8;&#x7C7B;ShareThread1&#x5728;run()&#x65B9;&#x6CD5;&#x4E2D;&#x5148;&#x5BF9;lock1&#x4E0A;&#x9501;&#xFF0C;&#x7136;&#x540E;&#x5BF9;lock2&#x4E0A;&#x9501;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x6709;lock2&#x4EE3;&#x7801;&#x5757;&#x8FD0;&#x884C;&#x7ED3;&#x675F;&#x89E3;&#x9501;&#x4E4B;&#x540E;&#xFF0C;lock1&#x624D;&#x80FD;&#x8FD0;&#x884C;&#x7ED3;&#x675F;&#x89E3;&#x9501;&#x3002;&#x7C7B;&#x4F3C;&#x7684;&#x5185;&#x90E8;&#x7C7B;ShareThread2&#x5728;run()&#x65B9;&#x6CD5;&#x4E2D;&#x5148;&#x5BF9;lock2&#x4E0A;&#x9501;&#xFF0C;&#x7136;&#x540E;&#x5BF9;lock1&#x4E0A;&#x9501;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x6709;lock1&#x4EE3;&#x7801;&#x5757;&#x8FD0;&#x884C;&#x7ED3;&#x675F;&#x89E3;&#x9501;&#x4E4B;&#x540E;&#xFF0C;lock2&#x624D;&#x80FD;&#x8FD0;&#x884C;&#x7ED3;&#x675F;&#x89E3;&#x9501;&#x3002;&#x5F53;&#x8FD9;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x542F;&#x52A8;&#x4EE5;&#x540E;&#xFF0C;&#x5206;&#x522B;&#x90FD;&#x63E1;&#x7740;&#x7B2C;&#x4E00;&#x4E2A;&#x9501;&#xFF0C;&#x7B49;&#x5F85;&#x7B2C;&#x4E8C;&#x4E2A;&#x9501;&#xFF0C;&#x7A0B;&#x5E8F;&#x6B7B;&#x9501;&#xFF01;</p>
<p>&#x2003;&#x2003;&#x5F53;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x7ADE;&#x4E89;&#x591A;&#x4E2A;&#x6392;&#x4ED6;&#x6027;&#x9501;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x6B7B;&#x9501;&#x3002;&#x89E3;&#x51B3;&#x7684;&#x65B9;&#x5F0F;&#x4E3A;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x4EE5;&#x540C;&#x6837;&#x7684;&#x987A;&#x5E8F;&#x83B7;&#x53D6;&#x9501;&#xFF0C;&#x4E0D;&#x51FA;&#x73B0;&#x4EA4;&#x53C9;&#x4E5F;&#x5C31;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x6B7B;&#x9501;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="1052--&#x4EA7;&#x751F;&#x6B7B;&#x9501;&#x7684;&#x539F;&#x56E0;&#x53CA;&#x6761;&#x4EF6;">10.5.2  &#x4EA7;&#x751F;&#x6B7B;&#x9501;&#x7684;&#x539F;&#x56E0;&#x53CA;&#x6761;&#x4EF6;</h3>
<p>&#x2003;&#x2003;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x4EA7;&#x751F;&#x6B7B;&#x9501;&#xFF1F;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x6B7B;&#x9501;&#xFF1F;&#x4E0B;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4E00;&#x8D77;&#x6765;&#x63A2;&#x8BA8;&#x6B7B;&#x9501;&#x4EA7;&#x751F;&#x7684;&#x539F;&#x56E0;&#x53CA;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6B7B;&#x9501;&#x4EA7;&#x751F;&#x7684;&#x539F;&#x56E0;&#x6709;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;1&#xFF09;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x4E0D;&#x8DB3;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x7684;&#x8D44;&#x6E90;&#x5145;&#x8DB3;&#xFF0C;&#x6240;&#x6709;&#x8FDB;&#x7A0B;&#x7684;&#x8D44;&#x6E90;&#x8BF7;&#x6C42;&#x90FD;&#x80FD;&#x591F;&#x5F97;&#x5230;&#x6EE1;&#x8DB3;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x6B7B;&#x9501;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;2&#xFF09;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#x63A8;&#x8FDB;&#x7684;&#x987A;&#x5E8F;&#x4E0D;&#x5408;&#x9002;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;3&#xFF09;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x4E0D;&#x5F53;&#x7B49;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4EA7;&#x751F;&#x6B7B;&#x9501;&#x7684;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#x6709;&#x4EE5;&#x4E0B;&#x56DB;&#x4E2A;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;1&#xFF09;&#x4E92;&#x65A5;&#x6761;&#x4EF6;&#xFF1A;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#x6BCF;&#x6B21;&#x53EA;&#x80FD;&#x88AB;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;2&#xFF09;&#x8BF7;&#x6C42;&#x4E0E;&#x4FDD;&#x6301;&#x6761;&#x4EF6;&#xFF1A;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x56E0;&#x8BF7;&#x6C42;&#x8D44;&#x6E90;&#x800C;&#x963B;&#x585E;&#x65F6;&#xFF0C;&#x5BF9;&#x5DF2;&#x83B7;&#x5F97;&#x7684;&#x8D44;&#x6E90;&#x4FDD;&#x6301;&#x4E0D;&#x653E;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;3&#xFF09;&#x4E0D;&#x5265;&#x593A;&#x6761;&#x4EF6;&#xFF1A;&#x8FDB;&#x7A0B;&#x5DF2;&#x83B7;&#x5F97;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5728;&#x672A;&#x4F7F;&#x7528;&#x5B8C;&#x4E4B;&#x524D;&#xFF0C;&#x4E0D;&#x80FD;&#x5F3A;&#x884C;&#x5265;&#x593A;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;4&#xFF09;&#x5FAA;&#x73AF;&#x7B49;&#x5F85;&#x6761;&#x4EF6;&#xFF1A;&#x82E5;&#x5E72;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x5F62;&#x6210;&#x4E00;&#x79CD;&#x5934;&#x5C3E;&#x76F8;&#x63A5;&#x7684;&#x5FAA;&#x73AF;&#x7B49;&#x5F85;&#x8D44;&#x6E90;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x2003;&#x2003;&#x53EA;&#x8981;&#x7CFB;&#x7EDF;&#x53D1;&#x751F;&#x6B7B;&#x9501;&#xFF0C;&#x8FD9;&#x56DB;&#x4E2A;&#x6761;&#x4EF6;&#x5C31;&#x5FC5;&#x7136;&#x6210;&#x7ACB;&#xFF1B;&#x53CD;&#x4E4B;&#xFF0C;&#x53EA;&#x8981;&#x7834;&#x574F;&#x56DB;&#x4E2A;&#x6761;&#x4EF6;&#x4E2D;&#x7684;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x6B7B;&#x9501;&#x7684;&#x4EA7;&#x751F;&#x3002;</p>
<h3 id="1053--&#x7EBF;&#x7A0B;&#x534F;&#x4F5C;">10.5.3  &#x7EBF;&#x7A0B;&#x534F;&#x4F5C;</h3>
<p>&#x2003;&#x2003;&#x901A;&#x8FC7;&#x4E4B;&#x524D;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x5E76;&#x521D;&#x6B65;&#x89E3;&#x51B3;&#x4E86;&#x591A;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E0B;&#x4E00;&#x6B65;&#x5B66;&#x4E60;&#x7684;&#x91CD;&#x70B9;&#x662F;&#x5982;&#x4F55;&#x8BA9;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x6709;&#x6548;&#x534F;&#x4F5C;&#x3002;&#x7EBF;&#x7A0B;&#x534F;&#x4F5C;&#x7684;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x6848;&#x4F8B;&#x5C31;&#x662F;&#x751F;&#x4EA7;&#x8005;&#x548C;&#x6D88;&#x8D39;&#x8005;&#x95EE;&#x9898;&#xFF0C;&#x751F;&#x4EA7;&#x8005;&#x548C;&#x6D88;&#x8D39;&#x8005;&#x7684;&#x8FD9;&#x79CD;&#x534F;&#x4F5C;&#x662F;&#x901A;&#x8FC7;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x63E1;&#x624B;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x63E1;&#x624B;&#x53C8;&#x662F;&#x901A;&#x8FC7;Object&#x7C7B;&#x7684;wait()&#x548C;notify()&#x65B9;&#x6CD5;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x4E0B;&#x9762;&#x5177;&#x4F53;&#x6765;&#x4E86;&#x89E3;&#x751F;&#x4EA7;&#x8005;&#x548C;&#x6D88;&#x8D39;&#x8005;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6709;&#x4E00;&#x5BB6;&#x9910;&#x5385;&#x4E3E;&#x529E;&#x5403;&#x70ED;&#x72D7;&#x6D3B;&#x52A8;&#xFF0C;&#x6D3B;&#x52A8;&#x65F6;&#x6709;5&#x4E2A;&#x987E;&#x5BA2;&#x6765;&#x5403;&#xFF0C;3&#x4E2A;&#x53A8;&#x5E08;&#x6765;&#x505A;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x6D6A;&#x8D39;&#xFF0C;&#x5236;&#x4F5C;&#x597D;&#x7684;&#x70ED;&#x72D7;&#x88AB;&#x653E;&#x8FDB;&#x4E00;&#x4E2A;&#x80FD;&#x88C5;10&#x4E2A;&#x70ED;&#x72D7;&#x7684;&#x957F;&#x6761;&#x72B6;&#x5BB9;&#x5668;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x6309;&#x7167;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#x7684;&#x539F;&#x5219;&#x53D6;&#x70ED;&#x72D7;&#x3002;&#x5982;&#x679C;&#x957F;&#x6761;&#x5BB9;&#x5668;&#x88AB;&#x88C5;&#x6EE1;&#xFF0C;&#x5219;&#x53A8;&#x5E08;&#x5DF2;&#x7ECF;&#x505A;&#x5B8C;&#x7684;&#x70ED;&#x72D7;&#x4E0D;&#x518D;&#x5F80;&#x957F;&#x6761;&#x5BB9;&#x5668;&#x91CC;&#x653E;&#xFF0C;&#x540C;&#x65F6;&#x505C;&#x6B62;&#x505A;&#x70ED;&#x72D7;&#xFF1B;&#x5982;&#x679C;&#x987E;&#x5BA2;&#x53D1;&#x73B0;&#x957F;&#x6761;&#x5BB9;&#x5668;&#x5185;&#x7684;&#x70ED;&#x72D7;&#x5403;&#x5B8C;&#x4E86;&#xFF0C;&#x5219;&#x63D0;&#x9192;&#x53A8;&#x5E08;&#x518D;&#x505A;&#x70ED;&#x72D7;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x53A8;&#x5E08;&#x5C31;&#x662F;&#x751F;&#x4EA7;&#x8005;&#xFF0C;&#x987E;&#x5BA2;&#x5C31;&#x662F;&#x6D88;&#x8D39;&#x8005;&#x3002;</p>
<p>&#x2003;&#x2003;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x95EE;&#x9898;&#xFF0C;&#x751F;&#x4EA7;&#x8005;&#x548C;&#x6D88;&#x8D39;&#x8005;&#x5171;&#x4EAB;&#x540C;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#xFF0C;&#x5E76;&#x4E14;&#x751F;&#x4EA7;&#x8005;&#x548C;&#x6D88;&#x8D39;&#x8005;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#xFF0C;&#x4E92;&#x4E3A;&#x6761;&#x4EF6;&#x3002;&#x5BF9;&#x4E8E;&#x751F;&#x4EA7;&#x8005;&#xFF0C;&#x5F53;&#x751F;&#x4EA7;&#x7684;&#x4EA7;&#x54C1;&#x88C5;&#x6EE1;&#x4E86;&#x4ED3;&#x5E93;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x505C;&#x6B62;&#x751F;&#x4EA7;&#xFF0C;&#x7B49;&#x5F85;&#x6D88;&#x8D39;&#x8005;&#x6D88;&#x8D39;&#x540E;&#x63D0;&#x9192;&#x751F;&#x4EA7;&#x8005;&#x7EE7;&#x7EED;&#x751F;&#x4EA7;&#x3002;&#x5BF9;&#x4E8E;&#x6D88;&#x8D39;&#x8005;&#xFF0C;&#x5F53;&#x53D1;&#x73B0;&#x4ED3;&#x5E93;&#x4E2D;&#x5DF2;&#x6CA1;&#x6709;&#x4EA7;&#x54C1;&#x65F6;&#xFF0C;&#x5219;&#x4E0D;&#x80FD;&#x6D88;&#x8D39;&#xFF0C;&#x7B49;&#x5F85;&#x751F;&#x4EA7;&#x8005;&#x751F;&#x4EA7;&#x51FA;&#x4EA7;&#x54C1;&#x4EE5;&#x540E;&#x901A;&#x77E5;&#x6D88;&#x8D39;&#x8005;&#x53EF;&#x4EE5;&#x6D88;&#x8D39;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E4B;&#x524D;&#x5B66;&#x4E60;&#x7684;synchronized&#x5173;&#x952E;&#x5B57;&#x53EF;&#x5B9E;&#x73B0;&#x5BF9;&#x5171;&#x4EAB;&#x8D44;&#x6E90;&#x7684;&#x4E92;&#x65A5;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x65E0;&#x6CD5;&#x5B9E;&#x73B0;&#x4E0D;&#x540C;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x6D88;&#x606F;&#x7684;&#x4F20;&#x9012;&#x3002;Java&#x63D0;&#x4F9B;&#x4E86;wait()&#x3001;notify()&#x3001;notifyAll()&#x4E09;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x89E3;&#x51B3;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x534F;&#x4F5C;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E09;&#x4E2A;&#x65B9;&#x6CD5;&#x5747;&#x662F;java.lang.Object&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x90FD;&#x53EA;&#x80FD;&#x5728;&#x540C;&#x6B65;&#x65B9;&#x6CD5;&#x6216;&#x8005;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#x5757;&#x4E2D;&#x4F7F;&#x7528;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x8FD9;&#x4E09;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x3002;</p>
<ul>
<li>void wait()</li>
</ul>
<p>&#x2003;&#x2003;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x7B49;&#x5F85;&#xFF0C;&#x7B49;&#x5F85;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x8C03;&#x7528;&#x6B64;&#x5BF9;&#x8C61;&#x7684;notify()&#x65B9;&#x6CD5;&#x6216;notifyAll()&#x65B9;&#x6CD5;&#x5C06;&#x5176;&#x5524;&#x9192;&#x3002;</p>
<ul>
<li>void notify()</li>
</ul>
<p>&#x2003;&#x2003;&#x5524;&#x9192;&#x5728;&#x6B64;&#x5BF9;&#x8C61;&#x9501;&#x4E0A;&#x7B49;&#x5F85;&#x7684;&#x5355;&#x4E2A;&#x7EBF;&#x7A0B;&#x3002;</p>
<ul>
<li>void notifyAll()</li>
</ul>
<p>&#x2003;&#x2003;&#x5524;&#x9192;&#x5728;&#x6B64;&#x5BF9;&#x8C61;&#x9501;&#x4E0A;&#x7B49;&#x5F85;&#x7684;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x3002;</p>
<p>&#x2003;&#x2003;&#x56FE;10.10&#x6240;&#x793A;&#x7684;&#x662F;&#x7EBF;&#x7A0B;&#x7B49;&#x5F85;&#x4E0E;&#x5524;&#x9192;&#x7684;&#x793A;&#x610F;&#x56FE;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5B8C;&#x6210;&#x5403;&#x70ED;&#x72D7;&#x6D3B;&#x52A8;&#x7684;&#x9700;&#x6C42;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x96BE;&#x5EA6;&#xFF0C;&#x73B0;&#x6574;&#x7406;&#x601D;&#x8DEF;&#x5982;&#x4E0B;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;1&#xFF09;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#x6A21;&#x62DF;&#x957F;&#x6761;&#x5BB9;&#x5668;&#x5B58;&#x653E;&#x70ED;&#x72D7;&#xFF0C;&#x96C6;&#x5408;&#x91CC;&#x5B9E;&#x9645;&#x5B58;&#x653E;Integer&#x5BF9;&#x8C61;&#xFF0C;&#x5176;&#x6570;&#x503C;&#x4EE3;&#x8868;&#x70ED;&#x72D7;&#x7684;&#x7F16;&#x53F7;&#xFF08;&#x70ED;&#x72D7;&#x7F16;&#x53F7;&#x89C4;&#x5219;&#x4E3E;&#x4F8B;&#xFF1A;300002&#x4EE3;&#x8868;&#x7F16;&#x53F7;&#x4E3A;3&#x7684;&#x53A8;&#x5E08;&#x505A;&#x7684;&#x7B2C;2&#x4E2A;&#x70ED;&#x72D7;&#xFF09;&#xFF0C;&#x8FD9;&#x6837;&#x80FD;&#x901A;&#x8FC7;&#x96C6;&#x5408;&#x6DFB;&#x52A0;&#x548C;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x5B9E;&#x73B0;&#x957F;&#x6761;&#x5BB9;&#x5668;&#x5185;&#x70ED;&#x72D7;&#x7684;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;2&#xFF09;&#x4EE5;&#x70ED;&#x72D7;&#x96C6;&#x5408;&#x4F5C;&#x4E3A;&#x5BF9;&#x8C61;&#x9501;&#xFF0C;&#x6240;&#x6709;&#x5BF9;&#x70ED;&#x72D7;&#x96C6;&#x5408;&#x7684;&#x64CD;&#x4F5C;&#xFF08;&#x5728;&#x957F;&#x6761;&#x5BB9;&#x5668;&#x4E2D;&#x6DFB;&#x52A0;&#x6216;&#x53D6;&#x8D70;&#x70ED;&#x72D7;&#xFF09;&#x4E92;&#x65A5;&#xFF0C;&#x8FD9;&#x6837;&#x4FDD;&#x8BC1;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x591A;&#x4E2A;&#x987E;&#x5BA2;&#x540C;&#x65F6;&#x53D6;&#x6700;&#x540E;&#x5269;&#x4E0B;&#x7684;&#x4E00;&#x4E2A;&#x70ED;&#x72D7;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x591A;&#x4E2A;&#x53A8;&#x5E08;&#x540C;&#x65F6;&#x6DFB;&#x52A0;&#x70ED;&#x72D7;&#x9020;&#x6210;&#x957F;&#x6761;&#x5BB9;&#x5668;&#x91CC;&#x70ED;&#x72D7;&#x6570;&#x5927;&#x4E8E;10&#x4E2A;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p align="center"><img src="../img/d10z/tu10.10.png"></p>  
<p align="center">&#x56FE;10.10  &#x7EBF;&#x7A0B;&#x7B49;&#x5F85;&#x4E0E;&#x5524;&#x9192;</p>  




<p>&#x2003;&#x2003;&#xFF08;3&#xFF09;&#x5F53;&#x53A8;&#x5E08;&#x5E0C;&#x671B;&#x5F80;&#x957F;&#x6761;&#x5BB9;&#x5668;&#x4E2D;&#x6DFB;&#x52A0;&#x70ED;&#x72D7;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x957F;&#x6761;&#x5BB9;&#x5668;&#x4E2D;&#x5DF2;&#x6709;10&#x4E2A;&#x70ED;&#x72D7;&#xFF0C;&#x5219;&#x505C;&#x6B62;&#x505A;&#x70ED;&#x72D7;&#xFF0C;&#x7B49;&#x5F85;&#x987E;&#x5BA2;&#x4ECE;&#x957F;&#x6761;&#x5BB9;&#x5668;&#x4E2D;&#x53D6;&#x8D70;&#x70ED;&#x72D7;&#x7684;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#xFF0C;&#x4EE5;&#x5524;&#x9192;&#x53A8;&#x5E08;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#xFF0C;&#x662F;&#x5426;&#x9700;&#x8981;&#x505A;&#x70ED;&#x72D7;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;4&#xFF09;&#x5F53;&#x987E;&#x5BA2;&#x5E0C;&#x671B;&#x4ECE;&#x957F;&#x6761;&#x5BB9;&#x5668;&#x4E2D;&#x53D6;&#x8D70;&#x70ED;&#x72D7;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x957F;&#x6761;&#x5BB9;&#x5668;&#x4E2D;&#x5DF2;&#x6CA1;&#x6709;&#x70ED;&#x72D7;&#xFF0C;&#x5219;&#x505C;&#x6B62;&#x5403;&#x70ED;&#x72D7;&#xFF0C;&#x7B49;&#x5F85;&#x53A8;&#x5E08;&#x5F80;&#x957F;&#x6761;&#x5BB9;&#x5668;&#x4E2D;&#x6DFB;&#x52A0;&#x70ED;&#x72D7;&#x7684;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#xFF0C;&#x4EE5;&#x5524;&#x9192;&#x987E;&#x5BA2;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#xFF0C;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x53D6;&#x8D70;&#x70ED;&#x72D7;&#x5403;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5B9E;&#x73B0;&#x6B64;&#x529F;&#x80FD;&#x7684;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>import java.util.*;

public class TestProdCons {

//&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5B58;&#x653E;&#x70ED;&#x72D7;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x91CC;&#x9762;&#x5B58;&#x653E;&#x7684;&#x662F;&#x6574;&#x6570;&#xFF0C;&#x4EE3;&#x8868;&#x70ED;&#x72D7;&#x7F16;&#x53F7;

private static final List&lt;Integer&gt; hotDogs = new ArrayList&lt;Integer&gt;();

public static void main(String[] args){

for(int i = 1;i &lt;= 3;i++){

new Producer(i).start();

}

for(int i = 1;i &lt;= 5;i++){

new Consumer(i).start();

}

try{

Thread.sleep(2000);

}catch(InterruptedException e){

e.printStackTrace();

}

System.exit(0);

}

//&#x751F;&#x4EA7;&#x8005;&#x7EBF;&#x7A0B;&#xFF0C;&#x4EE5;&#x70ED;&#x72D7;&#x96C6;&#x5408;&#x4F5C;&#x4E3A;&#x5BF9;&#x8C61;&#x9501;&#xFF0C;&#x6240;&#x6709;&#x5BF9;&#x70ED;&#x72D7;&#x96C6;&#x5408;&#x7684;&#x64CD;&#x4F5C;&#x4E92;&#x65A5;

private static class Producer extends Thread{

int i = 1;

int pid = -1;

public Producer(int id){

this.pid = id;

}

public void run(){

while(true){

try{

//&#x6A21;&#x62DF;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;

Thread.sleep(100);

} catch (InterruptedException e) {

e.printStackTrace();

}

synchronized(hotDogs){

if(hotDogs.size() &lt; 10){

//&#x70ED;&#x72D7;&#x7F16;&#x53F7;&#xFF0C;300002&#x4EE3;&#x8868;&#x7F16;&#x53F7;&#x4E3A;3&#x7684;&#x751F;&#x4EA7;&#x8005;&#x751F;&#x4EA7;&#x7684;&#x7B2C;2&#x4E2A;&#x70ED;&#x72D7;

hotDogs.add(pid*10000 + i);

System.out.println(&quot;&#x751F;&#x4EA7;&#x8005;&quot; + pid + &quot;&#x751F;&#x4EA7;&#x70ED;&#x72D7;&#xFF0C;&#x7F16;&#x53F7;&#x4E3A;&#xFF1A;&quot; + pid*10000 + i);

i++;

//&#x5524;&#x9192;hotDogs&#x5BF9;&#x8C61;&#x9501;&#x4E0A;&#x6240;&#x6709;&#x8C03;&#x7528;wait()&#x65B9;&#x6CD5;&#x7684;&#x7EBF;&#x7A0B;

hotDogs.notifyAll();

}else{

try{

System.out.println(&quot;&#x70ED;&#x72D7;&#x6570;&#x5DF2;&#x5230;10&#x4E2A;&#xFF0C;&#x7B49;&#x5F85;&#x6D88;&#x8D39;&#xFF01;&quot;);

hotDogs.wait();

}catch(InterruptedException e) {

e.printStackTrace();

}

}

}

}

}

}

//&#x6D88;&#x8D39;&#x8005;&#x7EBF;&#x7A0B;&#xFF0C;&#x4EE5;&#x70ED;&#x72D7;&#x96C6;&#x5408;&#x4F5C;&#x4E3A;&#x5BF9;&#x8C61;&#x9501;&#xFF0C;&#x6240;&#x6709;&#x5BF9;&#x70ED;&#x72D7;&#x96C6;&#x5408;&#x7684;&#x64CD;&#x4F5C;&#x4E92;&#x65A5;

private static class Consumer extends Thread {

int cid = -1;

public Consumer(int id){

this.cid = id;

}

public void run(){

while(true){

synchronized (hotDogs) {

try{

//&#x6A21;&#x62DF;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;

Thread.sleep(200);

}catch(InterruptedException e) {

e.printStackTrace();

}

if(hotDogs.size() &gt; 0) {

System.out.println(&quot;&#x6D88;&#x8D39;&#x8005;&quot; + this.cid + &quot;&#x6B63;&#x5728;&#x6D88;&#x8D39;&#x4E00;&#x4E2A;&#x70ED;&#x72D7;&#xFF0C;&#x5176;&#x7F16;&#x53F7;&#x4E3A;&#xFF1A;

&quot; + hotDogs.remove(0));

hotDogs.notifyAll();

}else{

try{

System.out.println(&quot;&#x5DF2;&#x6CA1;&#x6709;&#x70ED;&#x72D7;&#xFF0C;&#x7B49;&#x5F85;&#x751F;&#x4EA7;&#xFF01;&quot;);

hotDogs.wait();

}catch(InterruptedException e) {

e.printStackTrace();

}

}

}

}

}

}

}
</code></pre><p>&#x2003;&#x2003;&#x7F16;&#x8BD1;&#x3001;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD0;&#x884C;&#x7ED3;&#x679C;&#x5982;&#x56FE;10.11&#x6240;&#x793A;&#x3002;&#x901A;&#x8FC7;&#x8C03;&#x6574;&#x751F;&#x4EA7;&#x8005;&#x548C;&#x6D88;&#x8D39;&#x8005;&#x6A21;&#x62DF;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x91CD;&#x65B0;&#x7F16;&#x8BD1;&#x3001;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#xFF0C;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x7ED3;&#x679C;&#x4F1A;&#x663E;&#x793A;&#x51FA;&#x7B26;&#x5408;&#x9700;&#x6C42;&#x7684;&#x4E0D;&#x540C;&#x60C5;&#x51B5;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#x3002;</p>
<p align="center"><img src="../img/d10z/tu10.11.png"></p>  
<p align="center">&#x56FE;10.11  &#x751F;&#x4EA7;&#x8005;&#x6D88;&#x8D39;&#x8005;&#x95EE;&#x9898;</p>  






<h2 id="106--&#x4E0A;&#x673A;&#x4EFB;&#x52A1;">10.6  &#x4E0A;&#x673A;&#x4EFB;&#x52A1;</h2>
<h4 id="&#x76EE;&#x6807;&#xFF1A;&#x5B8C;&#x6210;&#x672C;&#x7AE0;105&#x8282;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x7A0B;&#x5E8F;&#x3002;">&#x76EE;&#x6807;&#xFF1A;&#x5B8C;&#x6210;&#x672C;&#x7AE0;10.5&#x8282;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x7A0B;&#x5E8F;&#x3002;</h4>
<p>&#x65F6;&#x95F4;&#xFF1A;40&#x5206;&#x949F;&#x3002;</p>
<p>&#x5F62;&#x5F0F;&#xFF1A;&#x6BCF;&#x4E2A;&#x5B66;&#x5458;&#x72EC;&#x7ACB;&#x5B8C;&#x6210;&#xFF0C;&#x5C0F;&#x7EC4;&#x7EC4;&#x957F;&#x68C0;&#x67E5;&#x3002;</p>
<p>&#x5DE5;&#x5177;&#xFF1A;EditPlus&#x3002;</p>
<h2 id="107--java-8&#x65B0;&#x7279;&#x6027;&#x7B80;&#x4ECB;">10.7  Java 8&#x65B0;&#x7279;&#x6027;&#x7B80;&#x4ECB;</h2>
<p>&#x2003;&#x2003;Java 8&#x662F;Java&#x8BED;&#x8A00;&#x5386;&#x53F2;&#x4E0A;&#x53D8;&#x5316;&#x6700;&#x5927;&#x7684;&#x7248;&#x672C;&#x4E4B;&#x4E00;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x91CC;&#x7A0B;&#x7891;&#x5F0F;&#x7684;&#x7248;&#x672C;&#x3002;</p>
<p>&#x2003;&#x2003;Java 8&#x627F;&#x8BFA;&#x8981;&#x8C03;&#x6574;Java&#x7F16;&#x7A0B;&#x5411;&#x7740;&#x51FD;&#x6570;&#x5F0F;&#x98CE;&#x683C;&#x8FC8;&#x8FDB;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x8BED;&#x6CD5;&#x3001;&#x7F16;&#x8BD1;&#x5668;&#x3001;&#x7C7B;&#x5E93;&#x4EE5;&#x53CA;Java&#x865A;&#x62DF;&#x673A;&#x7B49;&#x65B9;&#x9762;&#x90FD;&#x5E26;&#x6765;&#x4E86;&#x8BB8;&#x591A;&#x65B0;&#x7279;&#x6027;&#x3002;&#x672C;&#x8282;&#x5C06;&#x4ECB;&#x7ECD;Java 8&#x7684;&#x90E8;&#x5206;&#x65B0;&#x7279;&#x6027;&#x3002;</p>
<h3 id="1071--lambda&#x8868;&#x8FBE;&#x5F0F;">10.7.1  Lambda&#x8868;&#x8FBE;&#x5F0F;</h3>
<p>&#x2003;&#x2003;Java 8&#x7684;&#x4E00;&#x4E2A;&#x6700;&#x5927;&#x4EAE;&#x70B9;&#x5C31;&#x662F;Lambda&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x5B83;&#x5C06;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x5F15;&#x5165;&#x5230;Java&#x8BED;&#x8A00;&#x4E2D;&#x3002;&#x4E00;&#x4E2A;Lambda&#x8868;&#x8FBE;&#x5F0F;&#x7531;&#x4EE5;&#x4E0B;&#x4E09;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#x3002;</p>
<p>&#x2003;&#x2003;&#xFF08;1&#xFF09;&#x7528;&#x9017;&#x53F7;&#x5206;&#x9694;&#x7684;&#x53C2;&#x6570;&#x5217;&#x8868;&#xFF1B;</p>
<p>&#x2003;&#x2003;&#xFF08;2&#xFF09;&#x7BAD;&#x5934;&#x7B26;&#x53F7;&#xFF08;&#x2013;&gt;&#xFF09;&#xFF1B;</p>
<p>&#x2003;&#x2003;&#xFF08;3&#xFF09;&#x51FD;&#x6570;&#x4F53;&#xFF08;&#x8868;&#x8FBE;&#x5F0F;&#x6216;&#x4EE3;&#x7801;&#x5757;&#xFF09;&#x3002;</p>
<p>&#x2003;&#x2003;Lambda&#x8868;&#x8FBE;&#x5F0F;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x533F;&#x540D;&#x65B9;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code> public int add(int num1, int num2) {

&#x200B;        return num1 + num2;

 }
</code></pre><p>&#x2003;&#x2003;&#x53EF;&#x4EE5;&#x8F6C;&#x4E3A;&#x7B49;&#x4EF7;&#x7684;Lambda&#x8868;&#x8FBE;&#x5F0F;&#xFF1A;</p>
<pre><code> (int x, int y) -&gt; x + y;
</code></pre><h3 id="1072--&#x63A5;&#x53E3;&#x7684;&#x9ED8;&#x8BA4;&#x65B9;&#x6CD5;&#x4E0E;&#x9759;&#x6001;&#x65B9;&#x6CD5;">10.7.2  &#x63A5;&#x53E3;&#x7684;&#x9ED8;&#x8BA4;&#x65B9;&#x6CD5;&#x4E0E;&#x9759;&#x6001;&#x65B9;&#x6CD5;</h3>
<p>&#x2003;&#x2003;&#x5728;Java 8&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;default&#x5173;&#x952E;&#x5B57;&#x5728;&#x63A5;&#x53E3;&#x4E2D;&#x5B9A;&#x4E49;&#x9ED8;&#x8BA4;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x9ED8;&#x8BA4;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x8BE5;&#x63A5;&#x53E3;&#x7684;&#x6240;&#x6709;&#x5B9E;&#x73B0;&#x7C7B;&#x90FD;&#x4F1A;&#x9ED8;&#x8BA4;&#x5730;&#x4F7F;&#x7528;&#x8BE5;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5B9E;&#x73B0;&#x7C7B;&#x4E5F;&#x53EF;&#x4EE5;&#x5BF9;&#x8BE5;&#x9ED8;&#x8BA4;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x91CD;&#x5199;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code>public interface MyInterface {

&#x200B;     default String myFunction() {

&#x200B;         return &quot;hello world&quot;;

&#x200B;     }

}
</code></pre><p>&#x2003;&#x2003;&#x6B64;&#x5916;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5728;&#x63A5;&#x53E3;&#x4E2D;&#x5B9A;&#x4E49;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x9ED8;&#x8BA4;&#x5B9E;&#x73B0;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code>public interface MyInterface {

&#x200B;     static String myFunction() {

&#x200B;         return &quot;hello world&quot;;

&#x200B;     }

}
</code></pre><h3 id="1073--&#x65B9;&#x6CD5;&#x5F15;&#x7528;">10.7.3  &#x65B9;&#x6CD5;&#x5F15;&#x7528;</h3>
<p>&#x2003;&#x2003;Java 8&#x8FD8;&#x5141;&#x8BB8;&#x4F7F;&#x7528;::&#x6765;&#x5F15;&#x7528;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5176;&#x8BED;&#x6CD5;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>&#x7C7B;&#x540D;::&#x65B9;&#x6CD5;&#x540D;
</code></pre><p>&#x2003;&#x2003;&#x6CE8;&#x610F;&#xFF1A;&#x53EA;&#x5199;&#x65B9;&#x6CD5;&#x540D;&#x5373;&#x53EF;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5199;&#x62EC;&#x53F7;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5177;&#x4F53;&#x5730;&#x8BB2;&#xFF0C;&#x5171;&#x6709;&#x5982;&#x8868;10.1&#x6240;&#x793A;&#x7684;&#x56DB;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5F15;&#x7528;&#x3002;</p>
<p>&#x8868;10.1  &#x5F15;&#x7528;&#x7684;&#x7C7B;&#x578B;
|&#x7C7B;    &#x578B;    |&#x793A;    &#x4F8B;|
| ---- | ---- |
|&#x5F15;&#x7528;&#x9759;&#x6001;&#x65B9;&#x6CD5;    |ContainingClass::staticMethodName|
|&#x5F15;&#x7528;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5B9E;&#x4F8B;&#x65B9;&#x6CD5;    |ContainingObject::instanceMethodName|
|&#x5F15;&#x7528;&#x67D0;&#x4E2A;&#x7C7B;&#x578B;&#x7684;&#x4EFB;&#x610F;&#x5BF9;&#x8C61;&#x7684;&#x5B9E;&#x4F8B;&#x65B9;&#x6CD5;    |ContainingType::methodName|
|&#x5F15;&#x7528;&#x6784;&#x9020;&#x65B9;&#x6CD5;    |ClassName::new|</p>
<h3 id="1074--&#x91CD;&#x590D;&#x6CE8;&#x89E3;">10.7.4  &#x91CD;&#x590D;&#x6CE8;&#x89E3;</h3>
<p>&#x2003;&#x2003;&#x81EA;&#x4ECE;Java 5&#x5F15;&#x5165;&#x4E86;&#x6CE8;&#x89E3;&#x4EE5;&#x540E;&#xFF0C;&#x6CE8;&#x89E3;&#x5C31;&#x88AB;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x4E8E;&#x5404;&#x4E2A;&#x6846;&#x67B6;&#x4E4B;&#x4E2D;&#x3002;&#x4F46;Java 5&#x5F15;&#x5165;&#x7684;&#x6CE8;&#x89E3;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x4E0D;&#x80FD;&#x591A;&#x6B21;&#x4F7F;&#x7528;&#x540C;&#x4E00;&#x4E2A;&#x6CE8;&#x89E3;&#x3002;&#x800C;Java 8&#x5C31;&#x6253;&#x7834;&#x4E86;&#x8FD9;&#x4E2A;&#x9650;&#x5236;&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x91CD;&#x590D;&#x6CE8;&#x89E3;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5141;&#x8BB8;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x591A;&#x6B21;&#x4F7F;&#x7528;&#x540C;&#x4E00;&#x4E2A;&#x6CE8;&#x89E3;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5728;Java 8&#x4E2D;&#x4F7F;&#x7528;@Repeatable&#x6CE8;&#x89E3;&#x5B9A;&#x4E49;&#x91CD;&#x590D;&#x6CE8;&#x89E3;&#xFF0C;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>@Repeatable(Authorities.class)

public @interface Authority {

&#x200B;     String role();

}

public @interface Authorities {

&#x200B;    Authority[] value();

}

public class RepeatAnnotationUseNewVersion {

&#x200B;    @Authority(role=&quot;Admin&quot;)

&#x200B;    @Authority(role=&quot;Manager&quot;)

&#x200B;    public void doSomeThing(){ }

}
</code></pre><p>&#x2003;&#x2003;&#x5728;&#x521B;&#x5EFA;&#x91CD;&#x590D;&#x6CE8;&#x89E3;Authority&#x65F6;&#xFF0C;&#x52A0;&#x4E0A;@Repeatable&#x5E76;&#x6307;&#x5411;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x7684;&#x6CE8;&#x89E3;Authorities&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x91CD;&#x590D;&#x4F7F;&#x7528;Authority&#x6CE8;&#x89E3;&#x3002;</p>
<h3 id="1075--&#x5176;&#x4ED6;&#x7279;&#x6027;">10.7.5  &#x5176;&#x4ED6;&#x7279;&#x6027;</h3>
<p>&#x2003;&#x2003;Java 8&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;Function&#x3001;Supplier&#x3001;Optional&#x3001;Predicate&#x3001;Consumer &#x7B49;&#x63A5;&#x53E3;&#x7528;&#x4E8E;&#x7B80;&#x5316;&#x4EE3;&#x7801;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;Nashorn&#x5F15;&#x64CE;&#x4FBF;&#x4E8E;&#x5728;JVM&#x4E0A;&#x8FD0;&#x884C;JavaScript&#x4EE3;&#x7801;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x65B0;&#x7684;Date API&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x5BF9;&#x9AD8;&#x5E76;&#x53D1;&#x7684;&#x65B0;&#x652F;&#x6301;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x7C7B;&#x578B;&#x63A8;&#x6D4B;&#x673A;&#x5236;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x7C7B;&#x4F9D;&#x8D56;&#x5206;&#x6790;&#x5668;jdeps&#x2026;&#x2026;</p>
<p>&#x2003;&#x2003;&#x4E0D;&#x96BE;&#x770B;&#x51FA;&#xFF0C;Java 8&#x7684;&#x5347;&#x7EA7;&#x5FC5;&#x7136;&#x4F1A;&#x5BF9;&#x65E5;&#x540E;&#x7684;&#x5F00;&#x53D1;&#x5E26;&#x6765;&#x91CD;&#x5927;&#x5F71;&#x54CD;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5EFA;&#x8BAE;&#x5927;&#x5BB6;&#x5728;&#x8BFE;&#x540E;&#x4E00;&#x5B9A;&#x8981;&#x591A;&#x6D4F;&#x89C8;&#x6280;&#x672F;&#x6587;&#x7AE0;&#xFF0C;&#x591A;&#x4E0A;&#x673A;&#x5B9E;&#x8DF5;&#xFF0C;&#x65F6;&#x523B;&#x575A;&#x6301;&#x5B66;&#x4E60;&#xFF0C;&#x4E0D;&#x65AD;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#x6C34;&#x5E73;&#x3002;</p>
<h2 id="108--&#x672C;&#x7AE0;&#x7EC3;&#x4E60;">10.8  &#x672C;&#x7AE0;&#x7EC3;&#x4E60;</h2>
<p>1  &#x201C;<em>N</em>&#x4ECE;1&#x5F00;&#x59CB;&#xFF0C;&#x6BCF;&#x4E00;&#x8F6E;&#x4ECE;&#x5F85;&#x6392;&#x6570;&#x5217;&#x4E2D;&#x9009;&#x62E9;&#x7B2C;<em>N</em>&#x5C0F;&#xFF08;&#x6216;&#x5927;&#xFF09;&#x7684;&#x6570;&#x653E;&#x5230;&#x6392;&#x5E8F;&#x5217;&#x8868;&#x7684;&#x7B2C;<em>N</em>&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;&#x201D;&#x8FD9;&#x662F;&#x63CF;&#x8FF0;&#xFF08;    &#xFF09;&#x7B97;&#x6CD5;&#x3002;&#xFF08;&#x9009;&#x62E9;&#x4E00;&#x9879;&#xFF09; </p>
<p>&#x2003;&#x2003;A&#xFF0E;&#x5192;&#x6CE1;&#x6392;&#x5E8F;</p>
<p>&#x2003;&#x2003;B&#xFF0E;&#x76F4;&#x63A5;&#x63D2;&#x5165;&#x6392;&#x5E8F;</p>
<p>&#x2003;&#x2003;C&#xFF0E;&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x6392;&#x5E8F;</p>
<p>&#x2003;&#x2003;D&#xFF0E;&#x5FEB;&#x901F;&#x6392;&#x5E8F;</p>
<p>2  &#x8BF7;&#x63CF;&#x8FF0;ArrayList&#x548C;LinkedList&#x7684;&#x533A;&#x522B;&#x3002;</p>
<p>3  &#x8BF7;&#x63CF;&#x8FF0;HashMap&#x548C;Hashtable&#x7684;&#x5F02;&#x540C;&#xFF08;&#x81EA;&#x5DF1;&#x67E5;&#x9605;&#x8D44;&#x6599;&#xFF09;&#x3002;</p>
<p>4  &#x6839;&#x636E;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x6240;&#x5C5E;&#x7684;&#x9636;&#x6BB5;&#x548C;&#x88AB;&#x6D4B;&#x5BF9;&#x8C61;&#x7684;&#x89C4;&#x6A21;&#x5927;&#x5C0F;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x5206;&#x4E3A;<strong><em>__</em></strong>&#x3001;<strong><em>__</em></strong>&#x3001;<strong><em>__</em></strong>&#x548C;<strong><em>__</em></strong>&#x3002;</p>
<p>5  &#x4EC0;&#x4E48;&#x662F;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#xFF1F;&#x8BF7;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x8BED;&#x8A00;&#x52A0;&#x4EE5;&#x63CF;&#x8FF0;&#x3002;</p>
<p>6  &#x8BF7;&#x4ECB;&#x7ECD;&#x4E00;&#x4E2A;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x7684;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#x3002;</p>
<p>7  &#x8BF7;&#x5217;&#x51FA;&#x4E00;&#x4E2A;&#x7F3A;&#x9677;&#x62A5;&#x544A;&#x901A;&#x5E38;&#x5305;&#x62EC;&#x54EA;&#x4E9B;&#x5185;&#x5BB9;&#x3002;</p>
<p>8  &#x8BF7;&#x63CF;&#x8FF0;&#x5173;&#x4E8E;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x6D3B;&#x52A8;&#x901A;&#x5E38;&#x5305;&#x62EC;&#x54EA;&#x4E9B;&#x5185;&#x5BB9;&#x3002;</p>
<p>9  &#x4EC0;&#x4E48;&#x662F;&#x7EBF;&#x7A0B;&#x6B7B;&#x9501;&#xFF1F;&#x5E94;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#xFF1F;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="d9z.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 第九章    软件测试与JUnit">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十章    拓展阅读（选学）","level":"1.11","depth":1,"previous":{"title":"第九章    软件测试与JUnit","level":"1.10","depth":1,"path":"chapters/d9z.md","ref":"chapters/d9z.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapters/d10z.md","mtime":"2020-04-13T16:28:26.765Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-04-13T16:52:22.638Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

